{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Split",
        "pattern": {
          "String": "(\\[[^\\]]+]|Br?|Cl?|N|O|S|P|F|I|b|c|n|o|s|p|\\(|\\)|\\.|=|#|-|\\+|\\\\|\\/|:|~|@|\\?|>>?|\\*|\\$|\\%[0-9]{2}|[0-9])"
        },
        "behavior": "Isolated",
        "invert": false
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "#": 4,
      "%": 5,
      "(": 6,
      ")": 7,
      "*": 8,
      "+": 9,
      "-": 10,
      ".": 11,
      "/": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "6": 19,
      "7": 20,
      "8": 21,
      "9": 22,
      "=": 23,
      "@": 24,
      "A": 25,
      "B": 26,
      "C": 27,
      "D": 28,
      "E": 29,
      "F": 30,
      "G": 31,
      "H": 32,
      "I": 33,
      "K": 34,
      "L": 35,
      "M": 36,
      "N": 37,
      "O": 38,
      "P": 39,
      "R": 40,
      "S": 41,
      "T": 42,
      "U": 43,
      "V": 44,
      "W": 45,
      "X": 46,
      "Y": 47,
      "Z": 48,
      "[": 49,
      "\\": 50,
      "]": 51,
      "a": 52,
      "b": 53,
      "c": 54,
      "d": 55,
      "e": 56,
      "f": 57,
      "g": 58,
      "h": 59,
      "i": 60,
      "k": 61,
      "l": 62,
      "m": 63,
      "n": 64,
      "o": 65,
      "p": 66,
      "r": 67,
      "s": 68,
      "t": 69,
      "u": 70,
      "y": 71,
      "cc": 72,
      "CC": 73,
      "(C": 74,
      "O)": 75,
      "c1": 76,
      "=O)": 77,
      "(=O)": 78,
      "ccc": 79,
      "(C)": 80,
      "c2": 81,
      "H]": 82,
      "C(=O)": 83,
      "[C": 84,
      "[C@": 85,
      ")cc": 86,
      "CCCC": 87,
      "c(": 88,
      "c1cc": 89,
      "c3": 90,
      "C(": 91,
      "c1ccc": 92,
      "F)": 93,
      "ccccc": 94,
      "C1": 95,
      "2)": 96,
      "[C@@": 97,
      "OC": 98,
      "[C@H]": 99,
      "[C@@H]": 100,
      "CCC": 101,
      "(C)C": 102,
      "c1cccc": 103,
      "=C": 104,
      "(N": 105,
      ")cc1": 106,
      "CCN": 107,
      "CC1": 108,
      "CO": 109,
      "(F)": 110,
      "3)": 111,
      "(C(=O)": 112,
      "c2ccc": 113,
      "(-": 114,
      "n1": 115,
      "c4": 116,
      "C(=O)N": 117,
      "CN": 118,
      "(Cl": 119,
      "c1ccccc1": 120,
      "c2cc": 121,
      "c2ccccc": 122,
      "cn": 123,
      "(O)": 124,
      "CCO": 125,
      "CC(=O)": 126,
      "N)": 127,
      "=C(": 128,
      "C=C": 129,
      "c1n": 130,
      "S(=O)": 131,
      "CC(C)": 132,
      "NC(=O)": 133,
      "(C)C)": 134,
      "[n": 135,
      "C2": 136,
      "-]": 137,
      "S(=O)(=O)": 138,
      "c1ccc(": 139,
      "c(-": 140,
      "[nH]": 141,
      "(Cl)": 142,
      "+]": 143,
      "c3ccccc": 144,
      "N1": 145,
      "c3ccc": 146,
      "(CC": 147,
      "Cl": 148,
      "Br": 149,
      "CCCCCCCC": 150,
      "/C=C": 151,
      "c2ccccc2": 152,
      "NC": 153,
      "[N": 154,
      "4)": 155,
      "cccc": 156,
      "n2": 157,
      "c5": 158,
      "c(C": 159,
      "c(C)": 160,
      "c2n": 161,
      "c2)": 162,
      "OC)": 163,
      "[O": 164,
      "cc1": 165,
      "(C(=O)N": 166,
      "C(C)": 167,
      "[O-]": 168,
      "O=C(": 169,
      "(O": 170,
      "c2ccccc2)": 171,
      ")cc2": 172,
      "[N+]": 173,
      "c1)": 174,
      "c2cccc": 175,
      "CC2": 176,
      "C)": 177,
      "=O": 178,
      "[C@@H]1": 179,
      "[C@H]1": 180,
      "C=": 181,
      "C(F)": 182,
      "CC(=O)N": 183,
      "c1ccc(C": 184,
      "(NC(=O)": 185,
      "c3ccccc3": 186,
      "(N)": 187,
      "(F)(F)": 188,
      "F)cc": 189,
      "c(N": 190,
      "c1ccc2": 191,
      "CCC(": 192,
      "CCCN": 193,
      "=N": 194,
      "Cc1cc": 195,
      "CC2)": 196,
      "c4ccccc": 197,
      "C(=O)O": 198,
      "Br)": 199,
      "1)": 200,
      "c(=O)": 201,
      "c1ccc(-": 202,
      "/C=C\\": 203,
      "C(F)(F)": 204,
      "c1ccccc1)": 205,
      "OC(C)": 206,
      "c2ccc(": 207,
      "ccc2": 208,
      "(=O)[O-]": 209,
      "[N+](=O)[O-]": 210,
      "c3cc": 211,
      "[C@@H]2": 212,
      "[C@H]2": 213,
      "c3)": 214,
      "c6": 215,
      "c1cn": 216,
      "CCN(": 217,
      "c3ccccc3)": 218,
      "CC(C)(C)": 219,
      "(C(=O)O)": 220,
      ")cc2)": 221,
      "nc1": 222,
      "c4ccc": 223,
      "O=": 224,
      "OC(=O)": 225,
      "[2": 226,
      "[C@]": 227,
      "N2": 228,
      "[2H]": 229,
      "C3": 230,
      "CC)": 231,
      "COC(=O)": 232,
      "#N)": 233,
      "cc2": 234,
      "(CO)": 235,
      "/C=C/": 236,
      "c1ccc(N": 237,
      "c(F)": 238,
      "[C@@]": 239,
      "C2)": 240,
      "CCC1": 241,
      "Cl)": 242,
      "(F)(F)F)": 243,
      "5)": 244,
      "c(Cl)": 245,
      ".C": 246,
      ")ccc1": 247,
      "C(O)": 248,
      "n2)": 249,
      "[S": 250,
      "nc(-": 251,
      "n3": 252,
      "CN1": 253,
      "[C@@H](": 254,
      "nc2": 255,
      "C/C=C\\": 256,
      ")cc1)": 257,
      "c4ccccc4": 258,
      "c3cccc": 259,
      "C[C@H]": 260,
      "cs": 261,
      "C(=O)N1": 262,
      ".[": 263,
      "(CC)": 264,
      "(C(C)": 265,
      "CCOC(=O)": 266,
      "c1cc(": 267,
      "[2H])": 268,
      "Cc1n": 269,
      "OCC": 270,
      "[C@@H](O)": 271,
      "c1ccc2c(": 272,
      "CC(": 273,
      "2)cc1": 274,
      "CC3)": 275,
      "[C@@H](C)": 276,
      "c5ccccc": 277,
      "CS": 278,
      "=S": 279,
      "[Si": 280,
      "c3n": 281,
      "[C@H](O)": 282,
      "c2c(": 283,
      "c2ccc3": 284,
      "CC3": 285,
      "C(N)": 286,
      "[C@H](C)": 287,
      "(Cl)cc": 288,
      "C(C": 289,
      "[C@H](": 290,
      "=C(C": 291,
      "[Si]": 292,
      "CCC(C)": 293,
      "CCN(C(=O)": 294,
      "CCCO": 295,
      "c1ccc2c(c1)": 296,
      "C(=O)O)": 297,
      "CCCCC1": 298,
      "CCN1": 299,
      "O=C(O)": 300,
      "CC1)": 301,
      "cn1": 302,
      "s1": 303,
      "Cc1": 304,
      "O=C(N": 305,
      "F)cc1": 306,
      "ccc3": 307,
      "[C@@H](C": 308,
      "[C@H](C": 309,
      "CCCC1": 310,
      "c2c1": 311,
      "[N+](=O)[O-])": 312,
      "cc(-": 313,
      "N(": 314,
      ".Cl": 315,
      "c3ccc(": 316,
      "c12": 317,
      "c(N)": 318,
      "c2cn": 319,
      "[O-])": 320,
      "[C@@H]3": 321,
      "CCN(C": 322,
      "C(C)C": 323,
      "/C(": 324,
      "o1": 325,
      "2CCCC": 326,
      "=S)": 327,
      "(C(F)(F)F)": 328,
      "S(=O)(=O)N": 329,
      "2)c1": 330,
      "c7": 331,
      "Cc1cccc": 332,
      "COc1cc": 333,
      "nn": 334,
      "cc3": 335,
      "C/C=C\\C/C=C\\": 336,
      "cc(": 337,
      "(CN": 338,
      "Cc1ccc": 339,
      "Cn1": 340,
      ")cc3": 341,
      "C=C(": 342,
      "CN(": 343,
      ")cc3)": 344,
      "CCC2": 345,
      "P(=O)": 346,
      ".CC": 347,
      "c2ccc(-": 348,
      "c(O)": 349,
      "CC(O)": 350,
      "C3)": 351,
      "C1=O": 352,
      "c5ccccc5": 353,
      "c1ccc(Cl": 354,
      "CN(C)": 355,
      "CCNC(=O)": 356,
      "nc(": 357,
      "ccccc6": 358,
      "CNC(=O)": 359,
      "c4)": 360,
      ")cc2)cc1": 361,
      "(OC)": 362,
      "c4ccccc4)": 363,
      "CC(C)C": 364,
      "O=C1": 365,
      "c1C": 366,
      "CC(C": 367,
      "[C@H]3": 368,
      "N#": 369,
      "O=C(C": 370,
      "Cc1ccc(": 371,
      "(C)cc": 372,
      "c[nH]": 373,
      "OC(C)(C)C)": 374,
      "COc1ccc(": 375,
      "S(C)": 376,
      "CC(=O)O)": 377,
      "n(-": 378,
      "N(C)": 379,
      "=O)cc1": 380,
      "CCCCCCCCCCCCCCCC": 381,
      "n1)": 382,
      "Cc1ccccc1": 383,
      "#N": 384,
      "n(C)": 385,
      "c2ccc(Cl": 386,
      "c2)cc1": 387,
      "c3c(": 388,
      "[Si](C)": 389,
      "ncc": 390,
      "=C/": 391,
      "CC(=O)O": 392,
      "S(C)(=O)": 393,
      "CCOCCO": 394,
      "c6ccccc6": 395,
      "C(C)(C)": 396,
      "(Br)": 397,
      "c3ccc4": 398,
      "c1cc2": 399,
      "c2ccc(C": 400,
      "C(F)(F)F": 401,
      "c(OC)": 402,
      "c5ccc": 403,
      "CCn1": 404,
      "c2ccc(N": 405,
      "NC1": 406,
      "CCC(C": 407,
      "C(F)(F)F)": 408,
      "=C\\": 409,
      "c1c(": 410,
      "N(C": 411,
      "c(C)c1": 412,
      "NC(C)": 413,
      "CCS": 414,
      "nc3": 415,
      "CCC(=O)N": 416,
      "n3)": 417,
      "c(C(=O)N": 418,
      "(N)=O)": 419,
      "CC1(C)": 420,
      "OC1": 421,
      "3CCCC": 422,
      "=C1": 423,
      "CCCN1": 424,
      "CC2)cc1": 425,
      "c4cccc": 426,
      "=CC": 427,
      "n2)cc1": 428,
      "nc(N": 429,
      "ncn": 430,
      "C4": 431,
      "nc(C": 432,
      "c2ccccc21": 433,
      "COc1ccc(C": 434,
      "c1ccc(Cl)cc1": 435,
      "OC2": 436,
      "COc1cccc": 437,
      "C[C@@H]1": 438,
      "2)C1": 439,
      "2)CC1": 440,
      "c2ccc3c(": 441,
      "C(=S)": 442,
      "c(=O)[nH]": 443,
      "C(C)C)": 444,
      "c1ccc(C)": 445,
      "P(=O)(O)": 446,
      "c3ccc(-": 447,
      "O1": 448,
      "c4cc": 449,
      "CCCCCCCCCCCC": 450,
      "(C2": 451,
      "n4": 452,
      "[C@]1": 453,
      ".[C": 454,
      "C1)": 455,
      "C[C@H]1": 456,
      "C(=": 457,
      "C(C)(C)C": 458,
      "C[C@@H]": 459,
      "/N": 460,
      "(C(=O)NC": 461,
      "COC": 462,
      "ccccc2": 463,
      "3)cc1": 464,
      "([O-])": 465,
      "c2cc3": 466,
      "c1-": 467,
      "CN(C": 468,
      "C#": 469,
      "CC(=O)N1": 470,
      "c2ccc3c(c2)": 471,
      "c1ccc(-c2n": 472,
      "c1ccc(O": 473,
      "c1O": 474,
      "c2ccccc2)cc1": 475,
      "Nc1n": 476,
      "=C2": 477,
      "C(=O)OC": 478,
      "c1=O": 479,
      "c1cc(-": 480,
      "[NH": 481,
      "c1cccc2": 482,
      "[n+]": 483,
      "CCN(C)": 484,
      "(C#N)": 485,
      "OCO": 486,
      "CCC)": 487,
      "6)": 488,
      "NC(=O)N": 489,
      "I)": 490,
      "n(C": 491,
      "Cc1ccc(C": 492,
      "%1": 493,
      "c2cc(-": 494,
      "C=C1": 495,
      ".I": 496,
      ".CC(C)": 497,
      "ncc1": 498,
      "(C)C(C)": 499,
      "CC(C)(C)O": 500,
      "c3cn": 501,
      "(CCCC": 502,
      "(c2ccccc2)": 503,
      "c([2H])": 504,
      "/C=C(": 505,
      "2CC": 506,
      "[C@@]2": 507,
      "c1ccc(NC(=O)": 508,
      "[C@@]1": 509,
      "CN(C(=O)": 510,
      "ccccc7": 511,
      "ccc4": 512,
      "nn1": 513,
      "c-]": 514,
      "c1ccc(F)cc1": 515,
      "(C(C)(C)C)": 516,
      "CC4)": 517,
      "s1)": 518,
      "Br)cc1": 519,
      "c(Cl)cc": 520,
      "OC(C)=O)": 521,
      "C1CC1": 522,
      "F)cc2": 523,
      "c(O": 524,
      "C2=O)": 525,
      "(OC": 526,
      "S(C)(=O)=O)": 527,
      "CCCC(=O)": 528,
      "c2ccc(F)cc": 529,
      "2C": 530,
      "s2)": 531,
      "CC4": 532,
      "[nH]1": 533,
      "].[": 534,
      "(C(=O)O": 535,
      "(OC(=O)": 536,
      "CC(N": 537,
      "c8": 538,
      "c2s": 539,
      "c2)c1": 540,
      "c2ccccc2-": 541,
      "=C(N)": 542,
      "CCN(CC)": 543,
      "COc1ccccc1": 544,
      "C=N": 545,
      "c1ccc(C(=O)N": 546,
      "c(F)c1": 547,
      "OCCO": 548,
      "[C@]2": 549,
      "(F)(F)F)cc": 550,
      "CCN(CC": 551,
      "cc(C": 552,
      "NCC": 553,
      "c(Br)": 554,
      "(C)O": 555,
      "ccccc3": 556,
      "c1ccc(Cl)": 557,
      "no": 558,
      "([2H])": 559,
      "c2ccc(Cl)cc2)": 560,
      "c(NC(=O)": 561,
      "c7ccccc7": 562,
      "CCC3": 563,
      "c4ccc5": 564,
      "C(=O)N(": 565,
      "(F)cc": 566,
      "c(S": 567,
      "2C(=O)": 568,
      "=C)": 569,
      "c1ccc(C)cc1": 570,
      "cccc1": 571,
      "[C@H](CO)": 572,
      "CCOC": 573,
      "[c-]": 574,
      "C(=N": 575,
      ")cc4": 576,
      ".O": 577,
      "C2CCCC": 578,
      "[C@H]1O": 579,
      "c2cccc3": 580,
      "c3ccc(F)cc": 581,
      "C2)cc1": 582,
      "C=CC": 583,
      "CCCN(": 584,
      "CO)": 585,
      "Cc1cn": 586,
      "c(Cl)c1": 587,
      "N1C(=O)": 588,
      "c1c(C)": 589,
      "ccc21": 590,
      "c1cc(C": 591,
      "CC#": 592,
      "c5ccccc5)": 593,
      ")cc(-": 594,
      "cc(C)": 595,
      "NS(=O)(=O)": 596,
      "OC(C)(C)C": 597,
      "CC2)c1": 598,
      "n(": 599,
      "c1ccc(O)": 600,
      "C1CCCCC1": 601,
      "c1ccc(OC": 602,
      "C(C)(C)C)": 603,
      "CCOCC1": 604,
      "([N+](=O)[O-])": 605,
      "(N(": 606,
      "c1ccc(-n2": 607,
      "CCc1n": 608,
      "nc(C)": 609,
      "c3ccc4c(": 610,
      "[C@@H]4": 611,
      "(C(C)(C)C": 612,
      "(Cl)c1": 613,
      "CN=C(": 614,
      "c3ccc(Cl)cc": 615,
      "c2ccc(O": 616,
      "[C@@H](CC": 617,
      "c1s": 618,
      "[C@H](NC(=O)": 619,
      "ccc1": 620,
      "c1cc(N": 621,
      "c2ccc(OC": 622,
      "C[C@H]2": 623,
      "l)": 624,
      "c(OC": 625,
      "N3": 626,
      "Cc1cc(C)": 627,
      "COc1cc(": 628,
      "(CO": 629,
      "/C(=C\\": 630,
      "[C@H](CC": 631,
      "C(=O)N2": 632,
      "[C@@H](O": 633,
      "CCCCC": 634,
      "=C(C)": 635,
      "O=S(=O)": 636,
      "CCCNC(=O)": 637,
      ")cc4)": 638,
      "CCS(=O)(=O)": 639,
      "[C@@H]1O": 640,
      "F)cc1)": 641,
      "c2ccc(F)cc2)": 642,
      "CCC(O)": 643,
      "n[nH]": 644,
      "c(C(C)": 645,
      "cc4": 646,
      "c2ccc(C)": 647,
      "c3ccc4c(c3)": 648,
      "c1.": 649,
      "nc2)": 650,
      "c3ccccc2": 651,
      "N(C)C": 652,
      "Cc1ccc(N": 653,
      "[C@@H](NC(=O)": 654,
      "/C=C(\\": 655,
      "CC(=O)NC": 656,
      "(c1ccccc1)": 657,
      "(C)CC": 658,
      ")cc21": 659,
      "c1ncc": 660,
      "(C(C)C)": 661,
      "COC1": 662,
      "c2ccccc12": 663,
      "c2c(C)": 664,
      "C(=NC": 665,
      "c(C(=O)O)": 666,
      "C)cc1": 667,
      "o2)": 668,
      "N(C(=O)": 669,
      "ncc2": 670,
      "CCCCO": 671,
      "C=C(C)": 672,
      "CC(CC": 673,
      "CC(N)": 674,
      "c5)": 675,
      "CS(=O)(=O)": 676,
      "C[C@@H]2": 677,
      "C(N)=O)": 678,
      "c6ccc": 679,
      "c(F)c(F)": 680,
      "C#N)": 681,
      "c2=O)": 682,
      "c1ccc(F)": 683,
      "c2nc(-": 684,
      "C(CC": 685,
      "[C@H]4": 686,
      "n1-": 687,
      "[NH+]": 688,
      "c1cccc(-": 689,
      "c2cc(Cl)": 690,
      "c1OC": 691,
      "cccc2": 692,
      "c4ccc(-": 693,
      "CCCC2": 694,
      "S(=O)(=O)O)": 695,
      "s3)": 696,
      "CCCCCC": 697,
      "S(=O)(=O)N2": 698,
      "c1cs": 699,
      "o1)": 700,
      "c3cccc4": 701,
      "c12)": 702,
      "c3ccc(C": 703,
      "c(C(F)(F)F)": 704,
      "c21": 705,
      "[N-]": 706,
      "CCOCC2)": 707,
      "(C)C)cc1": 708,
      "c1nc(-": 709,
      "c(C(=O)": 710,
      ".CC.CC": 711,
      "c2ncc": 712,
      ".O=C(O)": 713,
      "[C@H](O": 714,
      "(F)c1": 715,
      "c2cccc(Cl)": 716,
      "c(cc1": 717,
      "C(F)(F)C(F)(F)": 718,
      "c2cc(C)": 719,
      "c(C#N)": 720,
      "sc1": 721,
      "[nH]c(=O)": 722,
      "=[N+]": 723,
      ".[N": 724,
      "c3cc(-": 725,
      "OC(": 726,
      "c2ncn": 727,
      "/C=N": 728,
      "cs1": 729,
      "N=C": 730,
      "c2)CC1": 731,
      "NCC1": 732,
      "cc2)": 733,
      "c3ccc(F)cc3)": 734,
      "CN1C(=O)": 735,
      "(C)c1": 736,
      "c2ccc(Cl)": 737,
      "c2ccc(Br": 738,
      "N(C)C(=O)": 739,
      "c4c(": 740,
      "/C=C\\C/C=C\\C/C=C\\": 741,
      "ccccc4": 742,
      "n5": 743,
      ".CO": 744,
      "CCCC(C)": 745,
      "c5cccc": 746,
      "c1ncn": 747,
      "N1CC": 748,
      "n2)c1": 749,
      ".C.C": 750,
      "c2n1": 751,
      "c1cccnc1": 752,
      "[C@]3": 753,
      "c1ccc(N2": 754,
      "co": 755,
      "C(=S)N": 756,
      "CCCN(C(=O)": 757,
      "Cl.": 758,
      "3CCO": 759,
      "c3cc4": 760,
      "CCC(=O)": 761,
      "(CN)": 762,
      "(F)F)": 763,
      "CC(C)(C)C": 764,
      "c1c[nH]": 765,
      "2]": 766,
      "c2cccc(-": 767,
      "nc4": 768,
      "(Cl)ccc1": 769,
      ".[Na": 770,
      "c1cc(F)cc": 771,
      "[N+](C)": 772,
      "C([2H])": 773,
      "C5": 774,
      "N=C(": 775,
      "c1ccc(C2": 776,
      ".[H": 777,
      "/C(=C/": 778,
      "[N+](=O)[O-])cc1": 779,
      "SC": 780,
      "c1cccc(": 781,
      "C(CC)": 782,
      "CCC4": 783,
      "c1ccc(F)cc1)": 784,
      "Cc1cc2": 785,
      "c2ccc(Cl)cc2": 786,
      "OC(CO)": 787,
      "c1ccccc1-": 788,
      "CCCCCCC": 789,
      "nc12": 790,
      "-]#": 791,
      "no1": 792,
      "CCC(N)": 793,
      "c(C2": 794,
      "CCO)": 795,
      "CCN1C(=O)": 796,
      "[C@@]3": 797,
      "c(OC)c1": 798,
      "CCN2": 799,
      "c1cccc(N": 800,
      "CCC(N": 801,
      "c3ccc(N": 802,
      "c1ccc(Br)cc1": 803,
      "c1[nH]": 804,
      "nn2": 805,
      "c2ccc(O)": 806,
      "[B": 807,
      "c2cc(": 808,
      "CC(NC(=O)": 809,
      "c2ccccc2)c1": 810,
      "CCOC(=O)C1": 811,
      "ccc(-": 812,
      "c1ccc(Cl)cc1)": 813,
      "NC(=O)C1": 814,
      "[C@@H](N)": 815,
      "c1ccc(O)cc1": 816,
      "CCCn1": 817,
      "c2cc(F)": 818,
      "S1": 819,
      "(C(=O)N2": 820,
      "CCC(C)(C)": 821,
      "c1ccncc1": 822,
      "CCNCC1": 823,
      "c%1": 824,
      "S)": 825,
      "C(=O)NC": 826,
      "C(O)C(O)": 827,
      "N1CCN(": 828,
      "Br)cc": 829,
      "[C@H](N": 830,
      "[N+]([O-])": 831,
      "c([N+](=O)[O-])": 832,
      "CCN)": 833,
      "n4)": 834,
      "c2cs": 835,
      "CCOC1": 836,
      "3)c1": 837,
      ".CC(C)(C)": 838,
      ".[Na+]": 839,
      "(CCC": 840,
      "[C@@H](O)[C@H](O)": 841,
      "C2=O)cc1": 842,
      "CC(C)O": 843,
      "c2cccc(F)": 844,
      "=N)": 845,
      "C(=O)C1": 846,
      "C(=O)N(C": 847,
      "c3ccc(Cl)cc3)": 848,
      "Cc1cc(": 849,
      "C/C=C/": 850,
      "C[C@H](O)": 851,
      "CCCC1)": 852,
      "(Cl)cc1": 853,
      "C1=": 854,
      "c1ccc(C(=O)": 855,
      "(CCO)": 856,
      "CN2": 857,
      "c2C)": 858,
      "n2cn": 859,
      "nc1-": 860,
      "ccccc8": 861,
      "c5ccc6": 862,
      "C2)c1": 863,
      "[C@H](C)C": 864,
      "C(NC(=O)": 865,
      "OP(=O)(O)": 866,
      "O=[N+]([O-])": 867,
      "c2cc(C": 868,
      "O)cc1": 869,
      "o3)": 870,
      "O=C(NC": 871,
      "CC#CC#": 872,
      "CCC(CC)": 873,
      "c3ccccc3-": 874,
      "c([2H])c([2H])": 875,
      "O[C@H](CO)": 876,
      "n1C": 877,
      "c(NC": 878,
      "3CC3)": 879,
      "c(N2": 880,
      "c2ccc(F)cc2": 881,
      "[C@]4": 882,
      "(C(C)=O)": 883,
      "#C": 884,
      "ccc5": 885,
      "3CC": 886,
      "(c3ccccc3)": 887,
      "nc1)": 888,
      "[C@@H](N": 889,
      "c1cccc(C": 890,
      "[P": 891,
      "(N)(=O)": 892,
      "[C@@H](CO)": 893,
      "COc1cc2": 894,
      "c6ccccc6)": 895,
      ".[HH]": 896,
      "2)n1": 897,
      "C4)": 898,
      "c1cccc(Cl)c1": 899,
      "CC2)CC1": 900,
      "n2)CC1": 901,
      "c2)C1": 902,
      "Cc1cc(N": 903,
      "C[C@@H](O)": 904,
      "7)": 905,
      "-]#[N+]": 906,
      "OCC1": 907,
      "nc3)": 908,
      "C(=O)NC1": 909,
      "[C@H](N)": 910,
      "C[C@@H](": 911,
      "C.": 912,
      "C(N)=O": 913,
      "CCCCC1)": 914,
      "(C)C2": 915,
      "c2[nH]": 916,
      "c2cc(N": 917,
      "/C(=N": 918,
      "CC(C)C)": 919,
      "2CCCCC2)": 920,
      "/C(C)": 921,
      "c3s": 922,
      "=C(\\": 923,
      "c3ccc(O": 924,
      "(C(=O)OC)": 925,
      "S(C)(=O)=O": 926,
      "c2ccccc2)CC1": 927,
      "C([2H])([2H])": 928,
      "c1ccc2ccccc2": 929,
      "nc2c1": 930,
      "CCCNC": 931,
      "c3ccccc23)": 932,
      "C(=O)N(C)": 933,
      "c1nc2ccccc2": 934,
      "C(N)=N": 935,
      "c9": 936,
      "/C=C2": 937,
      "c1cc(C)": 938,
      "c(-c3ccccc3)": 939,
      "c4cccc5": 940,
      "CCNC(=N": 941,
      ".N": 942,
      "c2ccc(F)": 943,
      "ccccc5": 944,
      "CC/C=C\\C/C=C\\C/C=C\\": 945,
      "CC(C)(C)OC(=O)N1": 946,
      "CC(=O)OC": 947,
      "c1c(-": 948,
      "CCCC)": 949,
      "COC(=O)C1": 950,
      "N2C(=O)": 951,
      "[C@H]1CC": 952,
      "C3=O)": 953,
      "Cc1ccc(-": 954,
      "c3c2": 955,
      "c2cc1": 956,
      "(COC(=O)": 957,
      "c8ccccc8": 958,
      "c1N": 959,
      "Cc2ccccc2": 960,
      "C(C#N)": 961,
      "CC.": 962,
      "n2cc": 963,
      "C#N": 964,
      "(CNC(=O)": 965,
      "OCc2ccccc2)": 966,
      "c4cn": 967,
      ")cc(OC)": 968,
      "nc(N)": 969,
      "CCC[C@H]1": 970,
      "c2nc3ccccc3": 971,
      "H-]": 972,
      "CNC1": 973,
      "c3nc(-": 974,
      "c5cc": 975,
      "OCc1ccccc1": 976,
      "c4ccc5c(": 977,
      "=NC": 978,
      "3CCOCC3)": 979,
      "c2ccccn2)": 980,
      "[n+]1": 981,
      "cc(Br)": 982,
      "S(N)(=O)": 983,
      "CCC(NC(=O)": 984,
      "CC(=O)N2": 985,
      "NC(": 986,
      "CCN(S(=O)(=O)": 987,
      "CCOCCOCCOCCO": 988,
      "[C@@H](C)C": 989,
      "CCNC(=NC": 990,
      "C12": 991,
      "c2o": 992,
      "C(=N)": 993,
      "cc3)": 994,
      "c2ccc(C)cc": 995,
      "l-]": 996,
      "COc1ccc(N": 997,
      "c23)": 998,
      "c2cccs2)": 999,
      "C2CC2)": 1000,
      ".c1ccc(-": 1001,
      "s2)cc1": 1002,
      "c1cccs1": 1003,
      "cc(N": 1004,
      "[Si](C)(C)C(C)": 1005,
      "c2)n1": 1006,
      "COP(=O)(O)": 1007,
      "c3cccc(-": 1008,
      "n1cn": 1009,
      "c1c(F)cc": 1010,
      "CCCCN1": 1011,
      "C(C)=O)": 1012,
      "n2-": 1013,
      "N(CC": 1014,
      "Cc1ccc2": 1015,
      "c2cc3c(": 1016,
      "c1cc(Cl)ccc1": 1017,
      "CCCN1C(=O)": 1018,
      "Cc1cc(-": 1019,
      "3)cc2)": 1020,
      "3CCCCC3)": 1021,
      "c2ccccc2Cl)": 1022,
      ")ccc1O": 1023
    },
    "merges": [
      [
        "c",
        "c"
      ],
      [
        "C",
        "C"
      ],
      [
        "(",
        "C"
      ],
      [
        "O",
        ")"
      ],
      [
        "c",
        "1"
      ],
      [
        "=",
        "O)"
      ],
      [
        "(",
        "=O)"
      ],
      [
        "cc",
        "c"
      ],
      [
        "(C",
        ")"
      ],
      [
        "c",
        "2"
      ],
      [
        "H",
        "]"
      ],
      [
        "C",
        "(=O)"
      ],
      [
        "[",
        "C"
      ],
      [
        "[C",
        "@"
      ],
      [
        ")",
        "cc"
      ],
      [
        "CC",
        "CC"
      ],
      [
        "c",
        "("
      ],
      [
        "c1",
        "cc"
      ],
      [
        "c",
        "3"
      ],
      [
        "C",
        "("
      ],
      [
        "c1",
        "ccc"
      ],
      [
        "F",
        ")"
      ],
      [
        "cc",
        "ccc"
      ],
      [
        "C",
        "1"
      ],
      [
        "2",
        ")"
      ],
      [
        "[C@",
        "@"
      ],
      [
        "O",
        "C"
      ],
      [
        "[C@",
        "H]"
      ],
      [
        "[C@@",
        "H]"
      ],
      [
        "CC",
        "C"
      ],
      [
        "(C)",
        "C"
      ],
      [
        "c1cc",
        "cc"
      ],
      [
        "=",
        "C"
      ],
      [
        "(",
        "N"
      ],
      [
        ")cc",
        "1"
      ],
      [
        "CC",
        "N"
      ],
      [
        "CC",
        "1"
      ],
      [
        "C",
        "O"
      ],
      [
        "(",
        "F)"
      ],
      [
        "3",
        ")"
      ],
      [
        "(C",
        "(=O)"
      ],
      [
        "c2",
        "ccc"
      ],
      [
        "(",
        "-"
      ],
      [
        "n",
        "1"
      ],
      [
        "c",
        "4"
      ],
      [
        "C(=O)",
        "N"
      ],
      [
        "C",
        "N"
      ],
      [
        "(C",
        "l"
      ],
      [
        "c1cccc",
        "c1"
      ],
      [
        "c2",
        "cc"
      ],
      [
        "c2",
        "ccccc"
      ],
      [
        "c",
        "n"
      ],
      [
        "(",
        "O)"
      ],
      [
        "CC",
        "O"
      ],
      [
        "CC",
        "(=O)"
      ],
      [
        "N",
        ")"
      ],
      [
        "=",
        "C("
      ],
      [
        "C",
        "=C"
      ],
      [
        "c1",
        "n"
      ],
      [
        "S",
        "(=O)"
      ],
      [
        "CC",
        "(C)"
      ],
      [
        "N",
        "C(=O)"
      ],
      [
        "(C)C",
        ")"
      ],
      [
        "[",
        "n"
      ],
      [
        "C",
        "2"
      ],
      [
        "-",
        "]"
      ],
      [
        "S(=O)",
        "(=O)"
      ],
      [
        "c1ccc",
        "("
      ],
      [
        "c(",
        "-"
      ],
      [
        "[n",
        "H]"
      ],
      [
        "(Cl",
        ")"
      ],
      [
        "+",
        "]"
      ],
      [
        "c3",
        "ccccc"
      ],
      [
        "N",
        "1"
      ],
      [
        "c3",
        "ccc"
      ],
      [
        "(",
        "CC"
      ],
      [
        "C",
        "l"
      ],
      [
        "B",
        "r"
      ],
      [
        "CCCC",
        "CCCC"
      ],
      [
        "/",
        "C=C"
      ],
      [
        "c2ccccc",
        "2"
      ],
      [
        "N",
        "C"
      ],
      [
        "[",
        "N"
      ],
      [
        "4",
        ")"
      ],
      [
        "cc",
        "cc"
      ],
      [
        "n",
        "2"
      ],
      [
        "c",
        "5"
      ],
      [
        "c",
        "(C"
      ],
      [
        "c",
        "(C)"
      ],
      [
        "c2",
        "n"
      ],
      [
        "c2",
        ")"
      ],
      [
        "OC",
        ")"
      ],
      [
        "[",
        "O"
      ],
      [
        "cc",
        "1"
      ],
      [
        "(C(=O)",
        "N"
      ],
      [
        "C",
        "(C)"
      ],
      [
        "[O",
        "-]"
      ],
      [
        "O",
        "=C("
      ],
      [
        "(",
        "O"
      ],
      [
        "c2ccccc",
        "2)"
      ],
      [
        ")cc",
        "2"
      ],
      [
        "[N",
        "+]"
      ],
      [
        "c1",
        ")"
      ],
      [
        "c2cc",
        "cc"
      ],
      [
        "CC",
        "2"
      ],
      [
        "C",
        ")"
      ],
      [
        "=",
        "O"
      ],
      [
        "[C@@H]",
        "1"
      ],
      [
        "[C@H]",
        "1"
      ],
      [
        "C",
        "="
      ],
      [
        "C(",
        "F)"
      ],
      [
        "CC(=O)",
        "N"
      ],
      [
        "c1ccc",
        "(C"
      ],
      [
        "(N",
        "C(=O)"
      ],
      [
        "c3ccccc",
        "3"
      ],
      [
        "(N",
        ")"
      ],
      [
        "(F)",
        "(F)"
      ],
      [
        "F",
        ")cc"
      ],
      [
        "c(",
        "N"
      ],
      [
        "c1ccc",
        "2"
      ],
      [
        "CC",
        "C("
      ],
      [
        "CCC",
        "N"
      ],
      [
        "=",
        "N"
      ],
      [
        "C",
        "c1cc"
      ],
      [
        "CC",
        "2)"
      ],
      [
        "c4",
        "ccccc"
      ],
      [
        "C(=O)",
        "O"
      ],
      [
        "Br",
        ")"
      ],
      [
        "1",
        ")"
      ],
      [
        "c",
        "(=O)"
      ],
      [
        "c1ccc",
        "(-"
      ],
      [
        "/C=C",
        "\\"
      ],
      [
        "C(F)",
        "(F)"
      ],
      [
        "c1ccccc1",
        ")"
      ],
      [
        "OC",
        "(C)"
      ],
      [
        "c2ccc",
        "("
      ],
      [
        "ccc",
        "2"
      ],
      [
        "(=O)",
        "[O-]"
      ],
      [
        "[N+]",
        "(=O)[O-]"
      ],
      [
        "c3",
        "cc"
      ],
      [
        "[C@@H]",
        "2"
      ],
      [
        "[C@H]",
        "2"
      ],
      [
        "c3",
        ")"
      ],
      [
        "c",
        "6"
      ],
      [
        "c1",
        "cn"
      ],
      [
        "CCN",
        "("
      ],
      [
        "c3ccccc",
        "3)"
      ],
      [
        "CC(C)",
        "(C)"
      ],
      [
        "(C(=O)",
        "O)"
      ],
      [
        ")cc",
        "2)"
      ],
      [
        "n",
        "c1"
      ],
      [
        "c4",
        "ccc"
      ],
      [
        "O",
        "="
      ],
      [
        "O",
        "C(=O)"
      ],
      [
        "[",
        "2"
      ],
      [
        "[C@",
        "]"
      ],
      [
        "N",
        "2"
      ],
      [
        "[2",
        "H]"
      ],
      [
        "C",
        "3"
      ],
      [
        "CC",
        ")"
      ],
      [
        "CO",
        "C(=O)"
      ],
      [
        "#",
        "N)"
      ],
      [
        "cc",
        "2"
      ],
      [
        "(C",
        "O)"
      ],
      [
        "/C=C",
        "/"
      ],
      [
        "c1ccc",
        "(N"
      ],
      [
        "c(",
        "F)"
      ],
      [
        "[C@@",
        "]"
      ],
      [
        "C",
        "2)"
      ],
      [
        "CC",
        "C1"
      ],
      [
        "Cl",
        ")"
      ],
      [
        "(F)(F)",
        "F)"
      ],
      [
        "5",
        ")"
      ],
      [
        "c",
        "(Cl)"
      ],
      [
        ".",
        "C"
      ],
      [
        ")cc",
        "c1"
      ],
      [
        "C(",
        "O)"
      ],
      [
        "n",
        "2)"
      ],
      [
        "[",
        "S"
      ],
      [
        "n",
        "c(-"
      ],
      [
        "n",
        "3"
      ],
      [
        "CN",
        "1"
      ],
      [
        "[C@@H]",
        "("
      ],
      [
        "n",
        "c2"
      ],
      [
        "C",
        "/C=C\\"
      ],
      [
        ")cc1",
        ")"
      ],
      [
        "c4ccccc",
        "4"
      ],
      [
        "c3",
        "cccc"
      ],
      [
        "C",
        "[C@H]"
      ],
      [
        "c",
        "s"
      ],
      [
        "C(=O)N",
        "1"
      ],
      [
        ".",
        "["
      ],
      [
        "(CC",
        ")"
      ],
      [
        "(C",
        "(C)"
      ],
      [
        "CCO",
        "C(=O)"
      ],
      [
        "c1cc",
        "("
      ],
      [
        "[2H]",
        ")"
      ],
      [
        "C",
        "c1n"
      ],
      [
        "O",
        "CC"
      ],
      [
        "[C@@H]",
        "(O)"
      ],
      [
        "c1ccc2",
        "c("
      ],
      [
        "CC",
        "("
      ],
      [
        "2",
        ")cc1"
      ],
      [
        "CC",
        "3)"
      ],
      [
        "[C@@H]",
        "(C)"
      ],
      [
        "c5",
        "ccccc"
      ],
      [
        "C",
        "S"
      ],
      [
        "=",
        "S"
      ],
      [
        "[S",
        "i"
      ],
      [
        "c3",
        "n"
      ],
      [
        "[C@H]",
        "(O)"
      ],
      [
        "c2",
        "c("
      ],
      [
        "c2ccc",
        "3"
      ],
      [
        "CC",
        "3"
      ],
      [
        "C(",
        "N)"
      ],
      [
        "[C@H]",
        "(C)"
      ],
      [
        "(Cl",
        ")cc"
      ],
      [
        "C",
        "(C"
      ],
      [
        "[C@H]",
        "("
      ],
      [
        "=C",
        "(C"
      ],
      [
        "[Si",
        "]"
      ],
      [
        "CCC",
        "(C)"
      ],
      [
        "CCN",
        "(C(=O)"
      ],
      [
        "CCC",
        "O"
      ],
      [
        "c1ccc2c(",
        "c1)"
      ],
      [
        "C(=O)",
        "O)"
      ],
      [
        "CCCC",
        "C1"
      ],
      [
        "CCN",
        "1"
      ],
      [
        "O=C(",
        "O)"
      ],
      [
        "CC1",
        ")"
      ],
      [
        "c",
        "n1"
      ],
      [
        "s",
        "1"
      ],
      [
        "C",
        "c1"
      ],
      [
        "O=C(",
        "N"
      ],
      [
        "F",
        ")cc1"
      ],
      [
        "ccc",
        "3"
      ],
      [
        "[C@@H]",
        "(C"
      ],
      [
        "[C@H]",
        "(C"
      ],
      [
        "CCCC",
        "1"
      ],
      [
        "c2",
        "c1"
      ],
      [
        "[N+](=O)[O-]",
        ")"
      ],
      [
        "cc",
        "(-"
      ],
      [
        "N",
        "("
      ],
      [
        ".",
        "Cl"
      ],
      [
        "c3ccc",
        "("
      ],
      [
        "c1",
        "2"
      ],
      [
        "c(",
        "N)"
      ],
      [
        "c2",
        "cn"
      ],
      [
        "[O-]",
        ")"
      ],
      [
        "[C@@H]",
        "3"
      ],
      [
        "CCN",
        "(C"
      ],
      [
        "C",
        "(C)C"
      ],
      [
        "/",
        "C("
      ],
      [
        "o",
        "1"
      ],
      [
        "2",
        "CCCC"
      ],
      [
        "=S",
        ")"
      ],
      [
        "(C",
        "(F)(F)F)"
      ],
      [
        "S(=O)(=O)",
        "N"
      ],
      [
        "2)",
        "c1"
      ],
      [
        "c",
        "7"
      ],
      [
        "C",
        "c1cccc"
      ],
      [
        "CO",
        "c1cc"
      ],
      [
        "n",
        "n"
      ],
      [
        "cc",
        "3"
      ],
      [
        "C/C=C\\",
        "C/C=C\\"
      ],
      [
        "cc",
        "("
      ],
      [
        "(C",
        "N"
      ],
      [
        "C",
        "c1ccc"
      ],
      [
        "C",
        "n1"
      ],
      [
        ")cc",
        "3"
      ],
      [
        "C",
        "=C("
      ],
      [
        "CN",
        "("
      ],
      [
        ")cc",
        "3)"
      ],
      [
        "CCC",
        "2"
      ],
      [
        "P",
        "(=O)"
      ],
      [
        ".",
        "CC"
      ],
      [
        "c2ccc",
        "(-"
      ],
      [
        "c(",
        "O)"
      ],
      [
        "CC",
        "(O)"
      ],
      [
        "C",
        "3)"
      ],
      [
        "C1",
        "=O"
      ],
      [
        "c5ccccc",
        "5"
      ],
      [
        "c1ccc",
        "(Cl"
      ],
      [
        "CN",
        "(C)"
      ],
      [
        "CCN",
        "C(=O)"
      ],
      [
        "n",
        "c("
      ],
      [
        "ccccc",
        "6"
      ],
      [
        "CN",
        "C(=O)"
      ],
      [
        "c4",
        ")"
      ],
      [
        ")cc2",
        ")cc1"
      ],
      [
        "(",
        "OC)"
      ],
      [
        "c4ccccc",
        "4)"
      ],
      [
        "CC",
        "(C)C"
      ],
      [
        "O=",
        "C1"
      ],
      [
        "c1",
        "C"
      ],
      [
        "CC",
        "(C"
      ],
      [
        "[C@H]",
        "3"
      ],
      [
        "N",
        "#"
      ],
      [
        "O",
        "=C(C"
      ],
      [
        "C",
        "c1ccc("
      ],
      [
        "(C)",
        "cc"
      ],
      [
        "c",
        "[nH]"
      ],
      [
        "OC(C)",
        "(C)C)"
      ],
      [
        "CO",
        "c1ccc("
      ],
      [
        "S",
        "(C)"
      ],
      [
        "CC(=O)",
        "O)"
      ],
      [
        "n",
        "(-"
      ],
      [
        "N",
        "(C)"
      ],
      [
        "=O)",
        "cc1"
      ],
      [
        "CCCCCCCC",
        "CCCCCCCC"
      ],
      [
        "n1",
        ")"
      ],
      [
        "C",
        "c1ccccc1"
      ],
      [
        "#",
        "N"
      ],
      [
        "n",
        "(C)"
      ],
      [
        "c2ccc",
        "(Cl"
      ],
      [
        "c2",
        ")cc1"
      ],
      [
        "c3",
        "c("
      ],
      [
        "[Si]",
        "(C)"
      ],
      [
        "n",
        "cc"
      ],
      [
        "=C",
        "/"
      ],
      [
        "CC(=O)",
        "O"
      ],
      [
        "S(C)",
        "(=O)"
      ],
      [
        "CCO",
        "CCO"
      ],
      [
        "c6",
        "ccccc6"
      ],
      [
        "C(C)",
        "(C)"
      ],
      [
        "(",
        "Br)"
      ],
      [
        "c3ccc",
        "4"
      ],
      [
        "c1cc",
        "2"
      ],
      [
        "c2ccc",
        "(C"
      ],
      [
        "C(F)(F)",
        "F"
      ],
      [
        "c(",
        "OC)"
      ],
      [
        "c5",
        "ccc"
      ],
      [
        "CC",
        "n1"
      ],
      [
        "c2ccc",
        "(N"
      ],
      [
        "N",
        "C1"
      ],
      [
        "CCC",
        "(C"
      ],
      [
        "C(F)(F)",
        "F)"
      ],
      [
        "=C",
        "\\"
      ],
      [
        "c1",
        "c("
      ],
      [
        "N",
        "(C"
      ],
      [
        "c(C)",
        "c1"
      ],
      [
        "NC",
        "(C)"
      ],
      [
        "CC",
        "S"
      ],
      [
        "n",
        "c3"
      ],
      [
        "CC",
        "C(=O)N"
      ],
      [
        "n",
        "3)"
      ],
      [
        "c",
        "(C(=O)N"
      ],
      [
        "(N)",
        "=O)"
      ],
      [
        "CC1",
        "(C)"
      ],
      [
        "O",
        "C1"
      ],
      [
        "3",
        "CCCC"
      ],
      [
        "=",
        "C1"
      ],
      [
        "CCC",
        "N1"
      ],
      [
        "CC2",
        ")cc1"
      ],
      [
        "c4",
        "cccc"
      ],
      [
        "=",
        "CC"
      ],
      [
        "n2",
        ")cc1"
      ],
      [
        "n",
        "c(N"
      ],
      [
        "n",
        "cn"
      ],
      [
        "C",
        "4"
      ],
      [
        "n",
        "c(C"
      ],
      [
        "c2ccccc2",
        "1"
      ],
      [
        "CO",
        "c1ccc(C"
      ],
      [
        "c1ccc(Cl",
        ")cc1"
      ],
      [
        "OC",
        "2"
      ],
      [
        "CO",
        "c1cccc"
      ],
      [
        "C",
        "[C@@H]1"
      ],
      [
        "2)",
        "C1"
      ],
      [
        "2)",
        "CC1"
      ],
      [
        "c2ccc3",
        "c("
      ],
      [
        "C(",
        "=S)"
      ],
      [
        "c(=O)",
        "[nH]"
      ],
      [
        "C",
        "(C)C)"
      ],
      [
        "c1ccc",
        "(C)"
      ],
      [
        "P(=O)",
        "(O)"
      ],
      [
        "c3ccc",
        "(-"
      ],
      [
        "O",
        "1"
      ],
      [
        "c4",
        "cc"
      ],
      [
        "CCCCCCCC",
        "CCCC"
      ],
      [
        "(C",
        "2"
      ],
      [
        "n",
        "4"
      ],
      [
        "[C@]",
        "1"
      ],
      [
        ".",
        "[C"
      ],
      [
        "C1",
        ")"
      ],
      [
        "C",
        "[C@H]1"
      ],
      [
        "C(",
        "="
      ],
      [
        "C(C)",
        "(C)C"
      ],
      [
        "C",
        "[C@@H]"
      ],
      [
        "/",
        "N"
      ],
      [
        "(C(=O)",
        "NC"
      ],
      [
        "C",
        "OC"
      ],
      [
        "ccccc",
        "2"
      ],
      [
        "3",
        ")cc1"
      ],
      [
        "(",
        "[O-])"
      ],
      [
        "c2cc",
        "3"
      ],
      [
        "c1",
        "-"
      ],
      [
        "CN",
        "(C"
      ],
      [
        "C",
        "#"
      ],
      [
        "CC(=O)",
        "N1"
      ],
      [
        "c2ccc3c(",
        "c2)"
      ],
      [
        "c1ccc(-",
        "c2n"
      ],
      [
        "c1ccc(",
        "O"
      ],
      [
        "c1",
        "O"
      ],
      [
        "c2ccccc2",
        ")cc1"
      ],
      [
        "N",
        "c1n"
      ],
      [
        "=C",
        "2"
      ],
      [
        "C(=O)",
        "OC"
      ],
      [
        "c1",
        "=O"
      ],
      [
        "c1cc",
        "(-"
      ],
      [
        "[N",
        "H"
      ],
      [
        "c1cccc",
        "2"
      ],
      [
        "[n",
        "+]"
      ],
      [
        "CCN",
        "(C)"
      ],
      [
        "(C",
        "#N)"
      ],
      [
        "OC",
        "O"
      ],
      [
        "CCC",
        ")"
      ],
      [
        "6",
        ")"
      ],
      [
        "N",
        "C(=O)N"
      ],
      [
        "I",
        ")"
      ],
      [
        "n",
        "(C"
      ],
      [
        "C",
        "c1ccc(C"
      ],
      [
        "%",
        "1"
      ],
      [
        "c2cc",
        "(-"
      ],
      [
        "C=",
        "C1"
      ],
      [
        ".",
        "I"
      ],
      [
        ".",
        "CC(C)"
      ],
      [
        "n",
        "cc1"
      ],
      [
        "(C)C",
        "(C)"
      ],
      [
        "CC(C)(C)",
        "O"
      ],
      [
        "c3",
        "cn"
      ],
      [
        "(",
        "CCCC"
      ],
      [
        "(",
        "c2ccccc2)"
      ],
      [
        "c(",
        "[2H])"
      ],
      [
        "/",
        "C=C("
      ],
      [
        "2",
        "CC"
      ],
      [
        "[C@@]",
        "2"
      ],
      [
        "c1ccc",
        "(NC(=O)"
      ],
      [
        "[C@@]",
        "1"
      ],
      [
        "CN",
        "(C(=O)"
      ],
      [
        "ccccc",
        "7"
      ],
      [
        "ccc",
        "4"
      ],
      [
        "n",
        "n1"
      ],
      [
        "c",
        "-]"
      ],
      [
        "c1ccc(",
        "F)cc1"
      ],
      [
        "(C(C)",
        "(C)C)"
      ],
      [
        "CC",
        "4)"
      ],
      [
        "s",
        "1)"
      ],
      [
        "Br",
        ")cc1"
      ],
      [
        "c",
        "(Cl)cc"
      ],
      [
        "OC(C)",
        "=O)"
      ],
      [
        "C1",
        "CC1"
      ],
      [
        "F",
        ")cc2"
      ],
      [
        "c(",
        "O"
      ],
      [
        "C2",
        "=O)"
      ],
      [
        "(",
        "OC"
      ],
      [
        "S(C)(=O)",
        "=O)"
      ],
      [
        "CCCC",
        "(=O)"
      ],
      [
        "c2ccc(",
        "F)cc"
      ],
      [
        "2",
        "C"
      ],
      [
        "s",
        "2)"
      ],
      [
        "CC",
        "4"
      ],
      [
        "[nH]",
        "1"
      ],
      [
        "]",
        ".["
      ],
      [
        "(C(=O)",
        "O"
      ],
      [
        "(O",
        "C(=O)"
      ],
      [
        "CC",
        "(N"
      ],
      [
        "c",
        "8"
      ],
      [
        "c2",
        "s"
      ],
      [
        "c2)",
        "c1"
      ],
      [
        "c2ccccc2",
        "-"
      ],
      [
        "=C(",
        "N)"
      ],
      [
        "CCN",
        "(CC)"
      ],
      [
        "CO",
        "c1ccccc1"
      ],
      [
        "C=",
        "N"
      ],
      [
        "c1ccc",
        "(C(=O)N"
      ],
      [
        "c(F)",
        "c1"
      ],
      [
        "O",
        "CCO"
      ],
      [
        "[C@]",
        "2"
      ],
      [
        "(F)(F)",
        "F)cc"
      ],
      [
        "CCN",
        "(CC"
      ],
      [
        "cc",
        "(C"
      ],
      [
        "N",
        "CC"
      ],
      [
        "c(",
        "Br)"
      ],
      [
        "(C)",
        "O"
      ],
      [
        "ccccc",
        "3"
      ],
      [
        "c1ccc",
        "(Cl)"
      ],
      [
        "n",
        "o"
      ],
      [
        "(",
        "[2H])"
      ],
      [
        "c2ccc(Cl",
        ")cc2)"
      ],
      [
        "c(",
        "NC(=O)"
      ],
      [
        "c7",
        "ccccc7"
      ],
      [
        "CCC",
        "3"
      ],
      [
        "c4ccc",
        "5"
      ],
      [
        "C(=O)N",
        "("
      ],
      [
        "(",
        "F)cc"
      ],
      [
        "c(",
        "S"
      ],
      [
        "2",
        "C(=O)"
      ],
      [
        "=C",
        ")"
      ],
      [
        "c1ccc(C)",
        "cc1"
      ],
      [
        "cccc",
        "1"
      ],
      [
        "[C@H]",
        "(CO)"
      ],
      [
        "CC",
        "OC"
      ],
      [
        "[",
        "c-]"
      ],
      [
        "C(",
        "=N"
      ],
      [
        ")cc",
        "4"
      ],
      [
        ".",
        "O"
      ],
      [
        "C2",
        "CCCC"
      ],
      [
        "[C@H]1",
        "O"
      ],
      [
        "c2cccc",
        "3"
      ],
      [
        "c3ccc(",
        "F)cc"
      ],
      [
        "C2",
        ")cc1"
      ],
      [
        "C=",
        "CC"
      ],
      [
        "CCCN",
        "("
      ],
      [
        "C",
        "O)"
      ],
      [
        "C",
        "c1cn"
      ],
      [
        "c(Cl)",
        "c1"
      ],
      [
        "N1",
        "C(=O)"
      ],
      [
        "c1",
        "c(C)"
      ],
      [
        "ccc2",
        "1"
      ],
      [
        "c1cc",
        "(C"
      ],
      [
        "CC",
        "#"
      ],
      [
        "c5ccccc",
        "5)"
      ],
      [
        ")cc",
        "(-"
      ],
      [
        "cc",
        "(C)"
      ],
      [
        "N",
        "S(=O)(=O)"
      ],
      [
        "OC(C)",
        "(C)C"
      ],
      [
        "CC2)",
        "c1"
      ],
      [
        "n",
        "("
      ],
      [
        "c1ccc",
        "(O)"
      ],
      [
        "C1",
        "CCCCC1"
      ],
      [
        "c1ccc(",
        "OC"
      ],
      [
        "C(C)",
        "(C)C)"
      ],
      [
        "CCO",
        "CC1"
      ],
      [
        "(",
        "[N+](=O)[O-])"
      ],
      [
        "(N",
        "("
      ],
      [
        "c1ccc(-",
        "n2"
      ],
      [
        "CC",
        "c1n"
      ],
      [
        "n",
        "c(C)"
      ],
      [
        "c3ccc4",
        "c("
      ],
      [
        "[C@@H]",
        "4"
      ],
      [
        "(C(C)",
        "(C)C"
      ],
      [
        "(Cl)",
        "c1"
      ],
      [
        "CN",
        "=C("
      ],
      [
        "c3ccc",
        "(Cl)cc"
      ],
      [
        "c2ccc",
        "(O"
      ],
      [
        "[C@@H]",
        "(CC"
      ],
      [
        "c1",
        "s"
      ],
      [
        "[C@H]",
        "(NC(=O)"
      ],
      [
        "cc",
        "c1"
      ],
      [
        "c1cc",
        "(N"
      ],
      [
        "c2ccc(",
        "OC"
      ],
      [
        "C",
        "[C@H]2"
      ],
      [
        "l",
        ")"
      ],
      [
        "c(",
        "OC"
      ],
      [
        "N",
        "3"
      ],
      [
        "Cc1cc",
        "(C)"
      ],
      [
        "CO",
        "c1cc("
      ],
      [
        "(C",
        "O"
      ],
      [
        "/C(",
        "=C\\"
      ],
      [
        "[C@H]",
        "(CC"
      ],
      [
        "C(=O)N",
        "2"
      ],
      [
        "[C@@H]",
        "(O"
      ],
      [
        "CCCC",
        "C"
      ],
      [
        "=C",
        "(C)"
      ],
      [
        "O=",
        "S(=O)"
      ],
      [
        "CCC",
        "NC(=O)"
      ],
      [
        ")cc",
        "4)"
      ],
      [
        "CC",
        "S(=O)(=O)"
      ],
      [
        "[C@@H]1",
        "O"
      ],
      [
        "F",
        ")cc1)"
      ],
      [
        "c2ccc(F)cc",
        "2)"
      ],
      [
        "CCC(",
        "O)"
      ],
      [
        "n",
        "[nH]"
      ],
      [
        "c(C",
        "(C)"
      ],
      [
        "cc",
        "4"
      ],
      [
        "c2ccc",
        "(C)"
      ],
      [
        "c3ccc4c(",
        "c3)"
      ],
      [
        "c1",
        "."
      ],
      [
        "n",
        "c2)"
      ],
      [
        "c3ccccc",
        "2"
      ],
      [
        "N",
        "(C)C"
      ],
      [
        "C",
        "c1ccc(N"
      ],
      [
        "[C@@H]",
        "(NC(=O)"
      ],
      [
        "/C=C(",
        "\\"
      ],
      [
        "CC(=O)",
        "NC"
      ],
      [
        "(",
        "c1ccccc1)"
      ],
      [
        "(C)",
        "CC"
      ],
      [
        ")cc2",
        "1"
      ],
      [
        "c1n",
        "cc"
      ],
      [
        "(C",
        "(C)C)"
      ],
      [
        "CO",
        "C1"
      ],
      [
        "c2cccc",
        "c12"
      ],
      [
        "c2",
        "c(C)"
      ],
      [
        "C(=",
        "NC"
      ],
      [
