{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Split",
        "pattern": {
          "String": "(\\[[^\\]]+]|Br?|Cl?|N|O|S|P|F|I|b|c|n|o|s|p|\\(|\\)|\\.|=|#|-|\\+|\\\\|\\/|:|~|@|\\?|>>?|\\*|\\$|\\%[0-9]{2}|[0-9])"
        },
        "behavior": "Isolated",
        "invert": false
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "#": 4,
      "%": 5,
      "(": 6,
      ")": 7,
      "+": 8,
      "-": 9,
      "/": 10,
      "0": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "7": 18,
      "8": 19,
      "9": 20,
      "=": 21,
      "@": 22,
      "B": 23,
      "C": 24,
      "F": 25,
      "H": 26,
      "I": 27,
      "L": 28,
      "M": 29,
      "N": 30,
      "O": 31,
      "P": 32,
      "S": 33,
      "[": 34,
      "\\": 35,
      "]": 36,
      "a": 37,
      "b": 38,
      "c": 39,
      "e": 40,
      "g": 41,
      "i": 42,
      "l": 43,
      "n": 44,
      "o": 45,
      "p": 46,
      "s": 47,
      "cc": 48,
      "CC": 49,
      "(C": 50,
      "O)": 51,
      "c1": 52,
      "=O)": 53,
      "(=O)": 54,
      "C1": 55,
      "c2": 56,
      "(C)": 57,
      "c1cc": 58,
      "c(": 59,
      "C2": 60,
      "C(=O)": 61,
      "H2": 62,
      "H1": 63,
      "H]": 64,
      ")cc": 65,
      "c2cc": 66,
      "N2": 67,
      "[C": 68,
      "[C@": 69,
      "c3": 70,
      "C(": 71,
      "F)": 72,
      "O2": 73,
      "c(C": 74,
      "CCCC": 75,
      "N3": 76,
      "Cl": 77,
      "O3": 78,
      "c1cccc": 79,
      "CO": 80,
      "CN": 81,
      "CC1": 82,
      "2)": 83,
      "CCN": 84,
      ")cc1": 85,
      "[C@@": 86,
      "C)": 87,
      "n1": 88,
      "c2cccc": 89,
      "c1ccc(": 90,
      "C(C)": 91,
      "[C@H]": 92,
      "[C@@H]": 93,
      "c3cc": 94,
      "N4": 95,
      "cn": 96,
      "N)": 97,
      "NC(=O)": 98,
      "(=O)N": 99,
      "(F)": 100,
      "O4": 101,
      "c1ccccc1": 102,
      "C=": 103,
      "c2ccccc2": 104,
      "CCO": 105,
      "c1n": 106,
      "CC(C)": 107,
      "3)": 108,
      "O=": 109,
      "C(=O)N": 110,
      "S(=O)": 111,
      "(CC": 112,
      "c(Cl": 113,
      "H3": 114,
      "CCC": 115,
      "c(C)": 116,
      "[n": 117,
      "[nH]": 118,
      "Cc1cc": 119,
      "(C(=O)": 120,
      "c4": 121,
      "N2O": 122,
      "OC": 123,
      "(O)": 124,
      "c3cccc": 125,
      "C15": 126,
      "C14": 127,
      "N5": 128,
      "C16": 129,
      "O2S": 130,
      "O3S": 131,
      "c2n": 132,
      "C13": 133,
      "C17": 134,
      "C18": 135,
      "C12": 136,
      "c(-": 137,
      "S(=O)(=O)": 138,
      "N3O": 139,
      "H20": 140,
      "cc1": 141,
      "C19": 142,
      ")c1": 143,
      ")N": 144,
      "H18": 145,
      "H19": 146,
      "H22": 147,
      "C20": 148,
      "H21": 149,
      "O=C(": 150,
      "NO": 151,
      "n2": 152,
      "C21": 153,
      "F)cc": 154,
      "C(C": 155,
      "c3ccccc3": 156,
      "H17": 157,
      "H23": 158,
      "c2ccc(": 159,
      "CC2": 160,
      "H16": 161,
      "H24": 162,
      "CCCN": 163,
      "(Cl": 164,
      "C22": 165,
      "[N": 166,
      "F3": 167,
      "c1ccc(C": 168,
      "-]": 169,
      "+]": 170,
      "OC)": 171,
      "O4S": 172,
      "c2)": 173,
      "CC(=O)N": 174,
      "(-": 175,
      "(C)C": 176,
      "C11": 177,
      "[N+]": 178,
      "(C)C)": 179,
      "=O": 180,
      "C/": 181,
      "H15": 182,
      "C23": 183,
      "[O": 184,
      "[O-]": 185,
      "N2O2": 186,
      "H25": 187,
      "cccc": 188,
      "CCC(": 189,
      "CC2)": 190,
      "N4O": 191,
      ")n": 192,
      "[C@@H]1": 193,
      "(N": 194,
      "cs": 195,
      "C(=": 196,
      "H26": 197,
      "H14": 198,
      "CC(=O)": 199,
      "(N)": 200,
      "c(=O)": 201,
      "[C@H]1": 202,
      "N1": 203,
      "(F)(F)": 204,
      "c2c(": 205,
      "(=O)[O-]": 206,
      "C(=O)O": 207,
      "[N+](=O)[O-]": 208,
      "N3O2": 209,
      "C24": 210,
      "N2O3": 211,
      "C(F)": 212,
      "Cc1ccc(": 213,
      "C3": 214,
      "F2": 215,
      "/C=": 216,
      "C10": 217,
      "c2ccccc2)": 218,
      "H13": 219,
      "c(N": 220,
      "c1)": 221,
      "N6": 222,
      "H27": 223,
      "Cc1n": 224,
      "COC(=O)": 225,
      "Cl2": 226,
      "Cc1": 227,
      "OCC": 228,
      "(C(=O)N": 229,
      ")cc2": 230,
      "NO2": 231,
      "H28": 232,
      "(NC(=O)": 233,
      "COc1cc": 234,
      "N3O3": 235,
      "C25": 236,
      "#N)": 237,
      "H12": 238,
      "1)": 239,
      "CN1": 240,
      "CCN(": 241,
      "NO3": 242,
      "C[C@H]": 243,
      "CCC1": 244,
      "C2)": 245,
      "c(Cl)": 246,
      "C(F)(F)": 247,
      "CC(C)(C)": 248,
      "[C@@H]2": 249,
      "COc1ccc(": 250,
      "N4O2": 251,
      "(O": 252,
      "CS": 253,
      "nn": 254,
      "=N": 255,
      ")cc2)": 256,
      "F)cc1": 257,
      "5S": 258,
      "=C(": 259,
      "c1ccccc1)": 260,
      "cc2": 261,
      "O=C(N": 262,
      "(Cl)": 263,
      "c2c1": 264,
      "S(=O)(=O)N": 265,
      "N5O": 266,
      "C9": 267,
      "(F)(F)F)": 268,
      "(C(=O)O)": 269,
      "N2O4": 270,
      "H29": 271,
      ")ccc1": 272,
      "CCOC(=O)": 273,
      "cn1": 274,
      "H11": 275,
      "c(F)": 276,
      "Cl)": 277,
      "C26": 278,
      "c1cn": 279,
      "o1": 280,
      "4)": 281,
      "Cc1cccc": 282,
      "H30": 283,
      "c(C(=O)": 284,
      "[C@H]2": 285,
      "C(=O)N1": 286,
      "CCCC1": 287,
      "[C@]": 288,
      "C[C@@H]": 289,
      "CCC(C)": 290,
      "nc1": 291,
      "2)cc1": 292,
      "N2O3S": 293,
      "OC(C)": 294,
      "c3n": 295,
      "CCN1": 296,
      "c4cccc": 297,
      ")N1": 298,
      "CCN(C(=O)": 299,
      "Cn1": 300,
      "(CC)": 301,
      "c(Cl)cc1": 302,
      "CCCCC1": 303,
      "C(N)": 304,
      "CC3)": 305,
      "NO4": 306,
      "2)c1": 307,
      "H10": 308,
      "N4O3": 309,
      "N2O2S": 310,
      "CCN(C": 311,
      "s1": 312,
      "[C@@]": 313,
      "c3c(": 314,
      "Cc1ccccc1": 315,
      "c2cn": 316,
      "ClF": 317,
      "CC(": 318,
      "c3)": 319,
      "N3O2S": 320,
      "/C=C/": 321,
      "c3ccc(": 322,
      "N3O3S": 323,
      "CC3": 324,
      "c3ccccc3)": 325,
      "c4cc": 326,
      "c12": 327,
      "C\\": 328,
      "O=C(O)": 329,
      "c2c(c1)": 330,
      "c(Cl)cc": 331,
      "CN(C)": 332,
      "N3O4": 333,
      "c2ccc(C": 334,
      "C8": 335,
      "C(=O)O)": 336,
      "(CO)": 337,
      "N2CCCC": 338,
      "CCC2": 339,
      "O=C(C": 340,
      "CCCCCCCC": 341,
      "nc(": 342,
      "N=": 343,
      "S2": 344,
      "N2O4S": 345,
      "H31": 346,
      "Si": 347,
      "c1ncc": 348,
      "ncc": 349,
      "COc1ccc(C": 350,
      "n3": 351,
      "C(O)": 352,
      "c4ccccc4": 353,
      "N5O2": 354,
      "C27": 355,
      "n2)": 356,
      "C(C)C": 357,
      "CNC(=O)": 358,
      "CC1)": 359,
      "c1ccc(-": 360,
      "co": 361,
      "H32": 362,
      "(OC)": 363,
      "C3)": 364,
      "[C@H](C)": 365,
      "OC(=O)": 366,
      "(CN": 367,
      "c(C)cc": 368,
      "CC(O)": 369,
      "CC)": 370,
      "[C@@H](C)": 371,
      "N#": 372,
      "C1=O": 373,
      "CCn1": 374,
      "C(C)(C)": 375,
      "=O)cc1": 376,
      "c(C(=O)N": 377,
      "c2ccc(Cl": 378,
      "O=C1": 379,
      "C#": 380,
      "c(C)c1": 381,
      "CCNC(=O)": 382,
      "H9": 383,
      "CCCO": 384,
      "c2ccc(F)cc": 385,
      "c(N)": 386,
      "NC(=O)N": 387,
      "N4O2S": 388,
      ")ccc2": 389,
      "S(C)": 390,
      "CC(C": 391,
      "n(C)": 392,
      "c1ccc(Cl)cc1": 393,
      "nc2": 394,
      "(F)cc": 395,
      "H4": 396,
      "c[nH]": 397,
      "CC=": 398,
      "N3O4S": 399,
      "C(=N": 400,
      "N7": 401,
      "CN(": 402,
      "CC2)cc1": 403,
      "CCS": 404,
      "c1ccc(F)cc1": 405,
      "CCC(C": 406,
      "C1=": 407,
      "c2ncc": 408,
      "[N+](=O)[O-])": 409,
      "COc1cccc": 410,
      "S(C)(=O)": 411,
      "C(C)C)": 412,
      "N6O": 413,
      "(C(F)(F)F)": 414,
      "N2O5": 415,
      "Cc1ccc(C": 416,
      "C[C@@H]1": 417,
      "N(C)": 418,
      "CN(C": 419,
      "[Si": 420,
      "CCN(CC": 421,
      "c1ccc2c(c1)": 422,
      "c5": 423,
      "NO3S": 424,
      "c2ccccc21": 425,
      "S)": 426,
      "C[C@H]1": 427,
      "N4O3S": 428,
      "nc(-": 429,
      "c(O)": 430,
      "2)CC1": 431,
      "O1": 432,
      "cnc1": 433,
      "cs1": 434,
      "C1CC1": 435,
      "c(=O)[nH]": 436,
      "c2)cc1": 437,
      "Cc2cc": 438,
      "c(OC)": 439,
      "(C2": 440,
      "N2OS": 441,
      "N3OS": 442,
      "NO2S": 443,
      "C7": 444,
      "H8": 445,
      "[Si]": 446,
      "CCCN1": 447,
      "C(C)(C)C": 448,
      "c(Cl)c1": 449,
      "C4": 450,
      "O)cc1": 451,
      "c1ccc(N": 452,
      "c1cc2": 453,
      "ccc1": 454,
      "(Cl)c1": 455,
      "H33": 456,
      "(N)=O)": 457,
      "[C@H](O)": 458,
      "NO5": 459,
      "2)C1": 460,
      "H34": 461,
      "n(-": 462,
      "[C@@H]3": 463,
      "Cc1cn": 464,
      "c(NC(=O)": 465,
      "[C@@H](O)": 466,
      "n1)": 467,
      "N4O4": 468,
      "nc(C": 469,
      "n2cc": 470,
      "C2CCCC": 471,
      "N5O3": 472,
      "[C@@H](": 473,
      "C28": 474,
      "CCN(C)": 475,
      "C/C=": 476,
      "C2)cc1": 477,
      "COc1ccccc1": 478,
      "CC1(C)": 479,
      "n2)cc1": 480,
      "c(S": 481,
      "N2O5S": 482,
      "(CC(=O)": 483,
      "CN(C(=O)": 484,
      "[C@H]3": 485,
      "C(F)(F)F)": 486,
      "c(F)cc": 487,
      "H18Cl": 488,
      "N2C(=O)": 489,
      "c23)": 490,
      "c(C)cc1": 491,
      "[C@H](": 492,
      "6S": 493,
      "c1C": 494,
      "(C(C)": 495,
      "NO4S": 496,
      "[nH]1": 497,
      "c1ccn": 498,
      "H17Cl": 499,
      "c(-c3cc": 500,
      "N4OS": 501,
      "CC(=O)O": 502,
      "C(C)(C)C)": 503,
      "N2CCO": 504,
      "H16Cl": 505,
      "c2ccccc2)cc1": 506,
      "CCC(=O)N": 507,
      "C1)": 508,
      "S)N": 509,
      "/C(=": 510,
      "H19Cl": 511,
      "(CC(=O)N": 512,
      "l)": 513,
      "Cc1cc(C)": 514,
      "c1cc(": 515,
      "CC(=O)N1": 516,
      "#N": 517,
      "c(C(=O)O)": 518,
      "NC1": 519,
      "(F)(F)F)cc": 520,
      "H20Cl": 521,
      "C)cc1": 522,
      "c(F)c1": 523,
      "C(F)(F)F": 524,
      "c2s": 525,
      "c1ccc(O": 526,
      "CC(C)C)": 527,
      "c2)c1": 528,
      "c1=O": 529,
      "H15Cl": 530,
      "(C#N)": 531,
      "c3c(c2)": 532,
      "[C@]1": 533,
      "CCN(CC)": 534,
      "N3O5": 535,
      "C2=O)": 536,
      "c1cccc2": 537,
      "c2ccc(Cl)cc2)": 538,
      ")cc2)cc1": 539,
      "Cc1ccc(-": 540,
      "CC2)c1": 541,
      "CCOCC1": 542,
      "C(=S)N": 543,
      "[Si](C)": 544,
      "CC(N": 545,
      "Cn1cc": 546,
      "S(C)(=O)=O)": 547,
      "c21": 548,
      "NS(=O)(=O)": 549,
      "H21Cl": 550,
      "CCc1n": 551,
      "O2)": 552,
      "c1cccc(": 553,
      "OC1": 554,
      "N6O2": 555,
      "c3cn": 556,
      "c(-c2cc": 557,
      "O5": 558,
      "n1cc": 559,
      "N3CCCC": 560,
      "c3ccc(F)cc": 561,
      "H14Cl": 562,
      ")cc3)": 563,
      "N5O2S": 564,
      "H7": 565,
      "CC4": 566,
      "n3)": 567,
      "N2CC": 568,
      "N2S": 569,
      "F4": 570,
      "[C@@H](C": 571,
      "c1ccc(NC(=O)": 572,
      "C6": 573,
      "n(C": 574,
      ")cc3": 575,
      "OC(C)(C)C)": 576,
      "CC(C)(C)O": 577,
      "N2CCC": 578,
      "NOS": 579,
      "[C@H](C": 580,
      "N4O4S": 581,
      "N3O5S": 582,
      "nn1": 583,
      "C#N)": 584,
      "C2)c1": 585,
      "c1ccc(Cl)": 586,
      "H22Cl": 587,
      "CCC(=O)": 588,
      "sc1": 589,
      "C1CCCCC1": 590,
      "c2cccn": 591,
      "H13Cl": 592,
      "Cc2ccccc2": 593,
      "(F)c1": 594,
      "N=C(": 595,
      "C[C@H]2": 596,
      "c2[nH]": 597,
      "CCS(=O)(=O)": 598,
      "(CCCC": 599,
      "CC(N)": 600,
      "[C@@]1": 601,
      "c2ccc3c(c2)": 602,
      "O)cc": 603,
      "N3S": 604,
      "O3)": 605,
      "OC)cc1": 606,
      "(Cl)cc": 607,
      "H36": 608,
      "c2cc(": 609,
      "C14H18": 610,
      "C14H19": 611,
      "c(O": 612,
      "H35": 613,
      "Nc1n": 614,
      "c2ccc(F)cc2)": 615,
      "CC(CC": 616,
      "H20F": 617,
      "nc(N": 618,
      "C=C1": 619,
      "c1cccc(Cl)c1": 620,
      "c(C(C)": 621,
      "(C)c1": 622,
      "c2n1": 623,
      "COc1ccc(-": 624,
      "[N+](=O)[O-])c1": 625,
      "/N=": 626,
      "c2ccccc12": 627,
      "CCCC2": 628,
      "ncn": 629,
      "CCc1cc": 630,
      "C=C(": 631,
      "c2cc3": 632,
      "H23Cl": 633,
      "[C@@]2": 634,
      "c(C2": 635,
      "[N+](=O)[O-])cc1": 636,
      "=C(N": 637,
      "3)cc1": 638,
      "C15H21": 639,
      "C13H17": 640,
      "C13H18": 641,
      "nc3": 642,
      "(C)cc": 643,
      "C(C)=O)": 644,
      "c2)CC1": 645,
      "N2O6": 646,
      "c2cccc(Cl)": 647,
      "c1ccc(C(=O)": 648,
      "CCC(O)": 649,
      "P(=O)": 650,
      "C15H22": 651,
      "C=C(C)": 652,
      "c3ccc(Cl)cc": 653,
      "CC1=": 654,
      "C15H19": 655,
      "C13H16": 656,
      "C(C#N)": 657,
      "C[C@@H]2": 658,
      "[C@]2": 659,
      "2)n1": 660,
      "C15H20": 661,
      "C14H20": 662,
      "CC(=O)O)": 663,
      "c2ncn": 664,
      "H12Cl": 665,
      "I)": 666,
      "c2ccccc2)c1": 667,
      "CO)": 668,
      "c1s": 669,
      "C14H17": 670,
      "CCCC(C)": 671,
      "CS(=O)(=O)": 672,
      "c1cc(-": 673,
      "C5": 674,
      "c(C(F)(F)F)": 675,
      "CCCN(": 676,
      "CC(NC(=O)": 677,
      "N1C(=O)": 678,
      "OCC)": 679,
      "(C)C)cc1": 680,
      "N(C": 681,
      "C14H21": 682,
      "C13H19": 683,
      "C15H18": 684,
      "cc3": 685,
      "H6": 686,
      "=C1": 687,
      "no": 688,
      "c1-": 689,
      "C(\\": 690,
      "N5O3S": 691,
      "N5OS": 692,
      "CCCN(C(=O)": 693,
      "CCC(N": 694,
      "c1ccc(F)": 695,
      "H5": 696,
      "[O-])": 697,
      "c4c(": 698,
      "c2C)": 699,
      "C16H22": 700,
      "COC1": 701,
      "cccc2": 702,
      "c(OC)c1": 703,
      "O6": 704,
      "C16H21": 705,
      "c2ccc(C)": 706,
      "N(": 707,
      "=S)": 708,
      "NO5S": 709,
      "NS": 710,
      "C12H16": 711,
      "c2ccc(Cl)cc2": 712,
      "co1": 713,
      "CN(CC": 714,
      "C#N": 715,
      "C14H16": 716,
      "C16H24": 717,
      "H15F": 718,
      "n1-": 719,
      "H23F": 720,
      "N2CCN(": 721,
      "ncc2": 722,
      "CCNC(=N": 723,
      "Cc1cc(": 724,
      "C20H22": 725,
      "C20H24": 726,
      "C21H24": 727,
      "c3ccc(F)cc3)": 728,
      "c2cccs": 729,
      "CCCNC(=O)": 730,
      "(CN)": 731,
      "c2ccc(-": 732,
      "C19H21": 733,
      "nc(C)": 734,
      "C16H19": 735,
      "c2cccc3": 736,
      "C16H18": 737,
      "C29": 738,
      "(Cl)ccc1": 739,
      "C19H22": 740,
      "c(C#N)": 741,
      "c1ccc(C)cc1": 742,
      "NO6": 743,
      "H11Cl": 744,
      "C18H21": 745,
      "cc(-": 746,
      "cn2": 747,
      "C17H19": 748,
      "c1ccc(C(=O)N": 749,
      "c2ccc(OC": 750,
      "c(Cl)n": 751,
      "c1cs": 752,
      "(CC(=O)O)": 753,
      "N7O": 754,
      "C(C(=O)": 755,
      "c2cccc(F)": 756,
      "C12H17": 757,
      "/C=N": 758,
      "C16H20": 759,
      "C17H18": 760,
      "C18H22": 761,
      "C(=O)OC": 762,
      "C17H21": 763,
      "C18H19": 764,
      "C15H17": 765,
      "C14H22": 766,
      "C(Cl)": 767,
      "c2ccc(N": 768,
      "C20H21": 769,
      "(OC)c1": 770,
      "c2=O)": 771,
      "C12H14": 772,
      "N8": 773,
      "c2cs": 774,
      "C2=O)cc1": 775,
      "S(=O)(=O)N1": 776,
      "O=S(=O)": 777,
      "C17H22": 778,
      "C22H24": 779,
      "C2CC2)": 780,
      "CC[C@H]": 781,
      "CN=C(N": 782,
      "C1CCCC": 783,
      "C18H18": 784,
      "CCC(N)": 785,
      "c3)n": 786,
      "N4S": 787,
      "CCC3": 788,
      "c1cccnc1": 789,
      "C16H17": 790,
      "(F)F)": 791,
      "c2cccc(": 792,
      "CN1C(=O)": 793,
      "[nH]c(=O)": 794,
      "C16H23": 795,
      "no1": 796,
      "c2)C1": 797,
      "N3CCO": 798,
      "C19H24": 799,
      "C15H24": 800,
      "c1cc(C": 801,
      "C21H22": 802,
      "c2ccccc2)CC1": 803,
      "C17H24": 804,
      "C21H25": 805,
      "C19H19": 806,
      "C2)n": 807,
      "C15H23": 808,
      "([O-])": 809,
      "C13H20": 810,
      "C12H18": 811,
      "C18H20": 812,
      "/C=C\\": 813,
      "=C2": 814,
      "n2cn": 815,
      "s1)": 816,
      "c3ncc": 817,
      "C15H16": 818,
      "[Si](C)(C)": 819,
      "c1cccs1": 820,
      "c1cc(C)": 821,
      "nc(S": 822,
      "CC(C)N": 823,
      "n[nH]": 824,
      "s2)": 825,
      "Cc1cc2": 826,
      "C17H20": 827,
      "C19H20": 828,
      "CCO)": 829,
      "C12H15": 830,
      "CCN1C(=O)": 831,
      "C16H16": 832,
      "CCCCO": 833,
      "C22H25": 834,
      "c2c(C)": 835,
      "CC(C)O": 836,
      "S1": 837,
      "c4ccccc4)": 838,
      "C18H24": 839,
      "CN2": 840,
      "N5O4": 841,
      "C13H14": 842,
      "(N)(=O)": 843,
      "C1CCCC1": 844,
      "C13H15": 845,
      "C17H17": 846,
      "c2ccccc2)n": 847,
      "C22H26": 848,
      "CCc1ccccc1": 849,
      "c(OC": 850,
      "c2ccc(Cl)": 851,
      "c2)n1": 852,
      "c1ccncc1": 853,
      "c2ccc(F)cc2": 854,
      "(CNC(=O)": 855,
      "CC[C@@H]": 856,
      "ncc1": 857,
      "COc1cc(": 858,
      "c1cc(N": 859,
      "c(CN": 860,
      "CCOC1": 861,
      "C20H25": 862,
      "C)c1": 863,
      "C21H26": 864,
      "c2cc(-": 865,
      "=S": 866,
      "4)n": 867,
      "c4)": 868,
      "c2c(c1": 869,
      "c12)": 870,
      "CCNCC1": 871,
      "H38": 872,
      "c1cc(F)cc": 873,
      "C20H23": 874,
      "c2o": 875,
      "c3ccccc3)n": 876,
      "C16H25": 877,
      "Cc3cc": 878,
      "C17H23": 879,
      "c1cccc(F)c1": 880,
      "c(cc1": 881,
      "Sc1n": 882,
      "c2cc(C": 883,
      "C19H23": 884,
      "c1[nH]": 885,
      "C19H18": 886,
      "c(CC": 887,
      "c2nc3ccccc3": 888,
      "C21H21": 889,
      "NC(=O)C1": 890,
      "C18H23": 891,
      "C17H25": 892,
      "c1cccc(-": 893,
      "H13F": 894,
      "(Cl)ccc2": 895,
      "C20H20": 896,
      "C21H23": 897,
      "N4O5": 898,
      "C11H14": 899,
      "C(C(=O)O)": 900,
      "n2)c1": 901,
      "C(CC)": 902,
      "(OC(=O)": 903,
      "c2ccc(O": 904,
      "Cc1ncc": 905,
      "N2CCOCC2)": 906,
      "(CCO)": 907,
      "C(=O)N(": 908,
      "N6O3": 909,
      "CCn1cc": 910,
      "C13H21": 911,
      "C17H16": 912,
      "H37": 913,
      "CSc1n": 914,
      "C2)C1": 915,
      "C(N)=O)": 916,
      "c2ccc(F)": 917,
      "C18H17": 918,
      "C2)n1": 919,
      "Cc1ccc(NC(=O)": 920,
      "C12H19": 921,
      "H10Cl": 922,
      "C23H25": 923,
      "c(C3": 924,
      "(F)(F)F)cc1": 925,
      "C20H19": 926,
      "C20H26": 927,
      "C19H25": 928,
      "C23H24": 929,
      "c2ccccc2c1": 930,
      "C(=O)N2": 931,
      "OCC1": 932,
      "CCOc1ccccc1": 933,
      "[C@H]1O": 934,
      "C14H14": 935,
      "(C(C)C)": 936,
      "C(N": 937,
      "C23H26": 938,
      "C22H22": 939,
      "C11H16": 940,
      "5)": 941,
      "=C/": 942,
      "C14H15": 943,
      "C17H26": 944,
      "c3nn": 945,
      "c1c(C)": 946,
      "CCC(CC)": 947,
      "(c2ccccc2)": 948,
      "c1ccc(C2": 949,
      "CCN(S(=O)(=O)": 950,
      "c2ccco": 951,
      "c2ccccn2)": 952,
      "c2ccccc2F)": 953,
      "C18H25": 954,
      "CC4)": 955,
      "N3O6": 956,
      "S(N)(=O)": 957,
      "n1C": 958,
      "c2no": 959,
      "C[C@@H](O)": 960,
      "O=[N+]": 961,
      "C(N)=O": 962,
      "c2nc(-": 963,
      "CCC(C)(C)": 964,
      "C12H20": 965,
      "n4": 966,
      "NCC": 967,
      "C(CC": 968,
      "/C(=C\\": 969,
      "[C@]12": 970,
      "Cc1cs": 971,
      "Cc1no": 972,
      "C22H27": 973,
      "CC[C@@H]1": 974,
      "c3ccc(Cl)cc3)": 975,
      "c3s": 976,
      "c1ncn": 977,
      "CNC1": 978,
      "C2)CC1": 979,
      "CCCC(=O)": 980,
      "c2cc(F)cc": 981,
      "CCC(NC(=O)": 982,
      "c1ccc([N+](=O)[O-])cc1": 983,
      "c(-c4cc": 984,
      "C13H22": 985,
      "C15H14": 986,
      "C11H15": 987,
      "cn2)": 988,
      "C14H23": 989,
      "S(C)(=O)=O": 990,
      "c2cc1": 991,
      "C16H26": 992,
      ")C1": 993,
      "C=N": 994,
      "c1ccccc1)c1ccccc1": 995,
      "Cc1ccc(C)": 996,
      "ccc2": 997,
      "(CO": 998,
      "FN3O2": 999,
      "C23H27": 1000,
      "CCOc1ccc(": 1001,
      "C[C@H](O)": 1002,
      "CCCn1": 1003,
      "c3ccccc23)": 1004,
      ")cc(": 1005,
      "OCC(=O)N": 1006,
      "C(N)=N": 1007,
      ")ccc21": 1008,
      "CC2)n1": 1009,
      "C15H15": 1010,
      "C18H16": 1011,
      "C(CO)": 1012,
      "CCCCN": 1013,
      "C20H18": 1014,
      "/C(=C/": 1015,
      "CCN2": 1016,
      "c3c2": 1017,
      "Cl)cc1": 1018,
      "C18H26": 1019,
      "C/C=C/": 1020,
      "FN2O2": 1021,
      "C22H23": 1022,
      "C19H26": 1023,
      "P(=O)(O)": 1024,
      "C12H13": 1025,
      "C11H12": 1026,
      "c1cccc(NC(=O)": 1027,
      "C11H17": 1028,
      "CN(C)C(=O)": 1029,
      "CC(C)C": 1030,
      "C(/": 1031,
      "nn2": 1032,
      "C12H12": 1033,
      "OCc1ccccc1": 1034,
      "C22H28": 1035,
      "(=": 1036,
      "C14H24": 1037,
      "c3cccn": 1038,
      "c1c[nH]": 1039,
      "n(CC": 1040,
      "c1O": 1041,
      "OC(C)(C)": 1042,
      "N2O3S2": 1043,
      "C11H18": 1044,
      "C(=S)": 1045,
      "c2ccccc2-": 1046,
      "cs1)": 1047,
      "C21H27": 1048,
      "COc1": 1049,
      "C19H17": 1050,
      "C(C(=O)N": 1051,
      "cs3)": 1052,
      "c1cc(Cl)ccc1": 1053,
      "CCCCN1": 1054,
      "c2c(F)cc": 1055,
      "/C=C(\\": 1056,
      "C23H28": 1057,
      "=C(N)": 1058,
      "c2cc(C)": 1059,
      "C11H13": 1060,
      "CC2)CC1": 1061,
      "[C@@H]1O": 1062,
      "COc1cc2": 1063,
      "C2=": 1064,
      "N4O5S": 1065,
      "O=[N+]([O-])": 1066,
      "C)N": 1067,
      "c2ccccc2)C1": 1068,
      "CCCN(C": 1069,
      "n(": 1070,
      "C24H26": 1071,
      "-c1n": 1072,
      "C3=O)": 1073,
      "C22H21": 1074,
      "CCO1": 1075,
      "C16H14": 1076,
      "H9Cl": 1077,
      "c3[nH]": 1078,
      "C2=O": 1079,
      "C(C)N": 1080,
      "C21H20": 1081,
      "o2)": 1082,
      "CCc1ccc(": 1083,
      "c3ccc(C": 1084,
      "FN3O": 1085,
      "c1ccccc1)N": 1086,
      "N2O6S": 1087,
      "C16H15": 1088,
      "CCCN2": 1089,
      "cn3)": 1090,
      "c2ccc([N+](=O)[O-]": 1091,
      "c(F)c(F)": 1092,
      "Cl)n": 1093,
      "C(F)F)": 1094,
      "c2cc(Cl)ccc2": 1095,
      "c1N": 1096,
      "C30": 1097,
      "nc2c1": 1098,
      "OS": 1099,
      "Cc1cccc(": 1100,
      "Cc1ccc(N": 1101,
      "C15H25": 1102,
      "n3cc": 1103,
      "7S": 1104,
      "CC[C@H]2": 1105,
      "C24H24": 1106,
      "c1cncc": 1107,
      "Cl)c1": 1108,
      "C12H22": 1109,
      "N3O3S2": 1110,
      "c(C)c(C)": 1111,
      "C24H25": 1112,
      "[C@H](CO)": 1113,
      "Cc1ccc(Cl)cc1": 1114,
      "C[C@@H](": 1115,
      "N3O2S2": 1116,
      "C=C": 1117,
      "c5cccc": 1118,
      "OCO2": 1119,
      ")C(=O)": 1120,
      "CC2)C1": 1121,
      "N2CCCC2": 1122,
      "C[C@H](": 1123,
      "CCCC3)": 1124,
      "c(F)cccc1": 1125,
      "CC(C)(C)OC(=O)N": 1126,
      "c1cccc(N": 1127,
      "CC(C)(C)OC(=O)N1": 1128,
      "N2O2S2": 1129,
      "-c1ccccc1": 1130,
      "FN2O": 1131,
      "C(=O)N(C)": 1132,
      "C21H19": 1133,
      "CCCC(=O)N": 1134,
      "C=CC": 1135,
      "C(NC(=O)": 1136,
      "C10H14": 1137,
      "c2F)": 1138,
      "C24H27": 1139,
      "n1cn": 1140,
      "Cc1ccc2c(c1)": 1141,
      "Cc1ccc(C(=O)": 1142,
      "C13H13": 1143,
      "N3CCOCC3)": 1144,
      "C12H21": 1145,
      "N2CCC(": 1146,
      "CCNC1": 1147,
      "c1ccco1": 1148,
      "Cc1cc(-": 1149,
      "CCCO1": 1150,
      "c1ccc(OC)cc1": 1151,
      "CCOCCO": 1152,
      "C17H27": 1153,
      "/C=C2": 1154,
      "C21H28": 1155,
      "c1nc(-": 1156,
      "c1ccc2n": 1157,
      "CC(F)(F)": 1158,
      "c1cccc(C": 1159,
      "C24H28": 1160,
      "Cc1cc(C": 1161,
      "c1nc2ccccc2": 1162,
      "C20H27": 1163,
      "C10H16": 1164,
      "o2)cc1": 1165,
      "[N-]": 1166,
      "c4c(c3)": 1167,
      "N2CCN(C(=O)": 1168,
      "C23H22": 1169,
      "C4)": 1170,
      "N5O4S": 1171,
      "N6O2S": 1172,
      "OC)cc": 1173,
      "CC#": 1174,
      ")ccc1O": 1175,
      "c1ccccc1Cl": 1176,
      "C13H24": 1177,
      "C11H19": 1178,
      "Cc3ccccc3": 1179,
      "C/C(=": 1180,
      "CC(=O)N(": 1181,
      "N(C)C(=O)": 1182,
      "3)cc2)": 1183,
      "NCC1": 1184,
      "C[C@H]3": 1185,
      "C10H12": 1186,
      "C11H20": 1187,
      "c(Cl)cccc1": 1188,
      "c2ccc(NC(=O)": 1189,
      "C13H12": 1190,
      "c1ccc(O)cc1": 1191,
      "COc1ccc(NC(=O)": 1192,
      "CC[C@H]1": 1193,
      "F6": 1194,
      "=O)cc": 1195,
      "(C(C)(C)C)": 1196,
      "FNO": 1197,
      "CCN)": 1198,
      "C/C=C\\": 1199,
      "c1ncccc1": 1200,
      "CCC3)": 1201,
      "c([N+](=O)[O-])c1": 1202,
      "C18H27": 1203,
      "CCC4": 1204,
      "sc2c1": 1205,
      "c1ccc(C)": 1206,
      "F3N2O2": 1207,
      "cc2)cc1": 1208,
      "C1=N": 1209,
      "H40": 1210,
      "FNO2": 1211,
      "c34)": 1212,
      "Cc1cc(N": 1213,
      "c1ccccn1": 1214,
      "C23H29": 1215,
      "C)C1": 1216,
      "N7O2": 1217,
      "CC(O": 1218,
      "C13H23": 1219,
      "CCCN1C(=O)": 1220,
      "s3)": 1221,
      "nc12": 1222,
      "CCC(=O)N1": 1223,
      "c2cccc(C)": 1224,
      "C15H26": 1225,
      "Cc1ccc(C(=O)N": 1226,
      "C(=O)N(C": 1227,
      "C19H16": 1228,
      "Cc1ccc(O": 1229,
      ")cc21": 1230,
      "C11H11": 1231,
      "c2cncc": 1232,
      "=C": 1233,
      "c2cc(N": 1234,
      "C19H27": 1235,
      "c1ccc(F)cc1)": 1236,
      "nc(N)": 1237,
      "FN2O3": 1238,
      "CC[C@]": 1239,
      "s2)cc1": 1240,
      "c3ccccn3)": 1241,
      "C20H28": 1242,
      "c3cccc(Cl)": 1243,
      "C17H15": 1244,
      ")ccn1": 1245,
      "CCCCCC1": 1246,
      "CCCCC3)": 1247,
      "C14H13": 1248,
      "N2O4S2": 1249,
      "C23H23": 1250,
      "C10H18": 1251,
      "C(F)F": 1252,
      "COC(=O)C1": 1253,
      "(C(F)(F)F)c1": 1254,
      "c1ccc(Cl)cc1)": 1255,
      "C14H12": 1256,
      "c2cccs2)": 1257,
      "/N=C/": 1258,
      "C(=O)OC(C)(C)C": 1259,
      "F3N2O": 1260,
      "c2ccccc2Cl)": 1261,
      "c2ccc(C)cc": 1262,
      "/N=C\\": 1263,
      "c2ccc(C(=O)N": 1264,
      "CC(C(=O)N": 1265,
      "C(F)(F)F)cc": 1266,
      "#N)cc1": 1267,
      "C17H14": 1268,
      "C[C@@H]3": 1269,
      "c2ccccc2)n1": 1270,
      "C18H28": 1271,
      "C20H17": 1272,
      "c1nc(N": 1273,
      "CCCCCC": 1274,
      "C10H15": 1275,
      "c3ccc(C)cc": 1276,
      "C10H13": 1277,
      "3CC3)": 1278,
      "C21H18": 1279,
      "[C@@]3": 1280,
      "C(C)=O": 1281,
      "C(=O)C1": 1282,
      "OCCO2": 1283,
      "CC12": 1284,
      "F5": 1285,
      "N5S": 1286,
      "FN3O3": 1287,
      "n12": 1288,
      "NN": 1289,
      "CCC(F)": 1290,
      "N2CCN(C": 1291,
      "Cc1cccc2": 1292,
      "/C=N\\": 1293,
      "C19H28": 1294,
      "COc1ccc(C(=O)": 1295,
      "C10H17": 1296,
      "C22H20": 1297,
      "Cc1ccc(F)cc1": 1298,
      "C24H29": 1299,
      "c(=O)n2": 1300,
      "CC1(": 1301,
      "c2nc(-c3cc": 1302,
      "/C(C)": 1303,
      "c2c(Cl)cc": 1304,
      "CC(C)(O)": 1305,
      "cccc3": 1306,
      "OC2": 1307,
      "[C@H](NC(=O)": 1308,
      "C(=O)NC1": 1309,
      "C22H29": 1310,
      "C10H11": 1311,
      "co3)": 1312,
      "cn1)": 1313,
      "C25H26": 1314,
      "C12H11": 1315,
      "Cc1ccc(S(=O)(=O)": 1316,
      "C23H30": 1317,
      "H39": 1318,
      "OCO": 1319,
      "O7": 1320,
      "c3C)": 1321,
      "c1cccc(O": 1322,
      "C23H21": 1323,
      "c1ccc(C(C)": 1324,
      "O=C1N": 1325,
      "C14H26": 1326,
      "C[C@H](C)": 1327,
      "CCCS": 1328,
      "c2cc(C)cc": 1329,
      "CC(CC(C": 1330,
      "C25H28": 1331,
      "(CC2": 1332,
      "C24H30": 1333,
      "CC(=": 1334,
      "CCOC(=O)C1": 1335,
      "c5ccccc5": 1336,
      "c(N3": 1337,
      ")cc(OC)c1": 1338,
      "(C)C(=O)": 1339,
      "C15H13": 1340,
      "COc1ccc(C2": 1341,
      "c3ccccc32)": 1342,
      "c2-": 1343,
      "c(=S)": 1344,
      "Cc1o": 1345,
      "C=O": 1346,
      ")c1cn": 1347,
      "F3N3O2": 1348,
      "C14H25": 1349,
      "c2c[nH]": 1350,
      "c23)cc1": 1351,
      "=O)c1": 1352,
      "C17H28": 1353,
      "C=CC=": 1354,
      "on1": 1355,
      "c1ccc(CN": 1356,
      "C25H27": 1357,
      "(CCC)": 1358,
      "c2ccc(C(F)(F)F)cc": 1359,
      "c1ccc(C(F)(F)F)cc1": 1360,
      "CC[C@@H]2": 1361,
      "C(=O)O)cc1": 1362,
      "C[C@@H](C)": 1363,
      "C[C@H](NC(=O)": 1364,
      "[C@@H](N)": 1365,
      "OC(": 1366,
      "c2ccccc12)": 1367,
      "c1cc2cccc": 1368,
      "CCOC)": 1369,
      "c1ccccc1F": 1370,
      "CCC(=O)O": 1371,
      "Cc1[nH]": 1372,
      "N2CCN": 1373,
      "/C=N/": 1374,
      "cc(": 1375,
      "CCCO2": 1376,
      "H8Cl": 1377,
      "c1cc(Cl)": 1378,
      "Cc1nn(C)": 1379,
      "O)c1": 1380,
      "c2ccncc": 1381,
      "Cn1cn": 1382,
      "ncn1": 1383,
      "c2cccc(C(F)(F)F)": 1384,
      ")ccc3": 1385,
      "CCCCC1)": 1386,
      "C16H27": 1387,
      "N6OS": 1388,
      "c(C(C)C)": 1389,
      "o3)": 1390,
      "CC(C)C1": 1391,
      "C25H25": 1392,
      "c1ccc(Cl)c(Cl)c1": 1393,
      "SC": 1394,
      ")cc2)CC1": 1395,
      "CCC2(": 1396,
      "FNO3": 1397,
      ")cccc1": 1398,
      "ccc3": 1399,
      "c1ccccc1O": 1400,
      "C15H12": 1401,
      "N3O4S2": 1402,
      "FC(F)(F)": 1403,
      "Cc1s": 1404,
      "C1=O)": 1405,
      "N4O2S2": 1406,
      "C11H21": 1407,
      "CC2CCCC": 1408,
      "C22H19": 1409,
      "co1)": 1410,
      "N(C(=O)": 1411,
      "COc1ccc(OC)": 1412,
      "CCl": 1413,
      "F3N3O": 1414,
      "c(C)n1": 1415,
      "C10H10": 1416,
      "C(C)O": 1417,
      "n2)CC1": 1418,
      "ccccc12": 1419,
      "C12H23": 1420,
      "Cc1cc(F)cc": 1421,
      "c3ccc(Cl)cc3": 1422,
      "CNS(=O)(=O)": 1423,
      "CCC(C(=O)N": 1424,
      "C25H24": 1425,
      "(C(N)=O)": 1426,
      "c(=O)n(C)": 1427,
      "c1ccc(-c2n": 1428,
      "C12H24": 1429,
      "c(SCC(=O)N": 1430,
      ")cc2)c1": 1431,
      "Cc1cccc(-": 1432,
      "c(Cl)c2)": 1433,
      "c(S(=O)(=O)": 1434,
      "C9H14": 1435,
      "c1cc(F)": 1436,
      "CCCC1)": 1437,
      "CCCNC1": 1438,
      "c3ccc4c(c3)": 1439,
      "/C(=N": 1440,
      "CCc1": 1441,
      "C22H30": 1442,
      "CC(C(=O)O)": 1443,
      "c2ccc(O)": 1444,
      "[C@@H]4": 1445,
      "O=C(O)C1": 1446,
      "C24H22": 1447,
      "C(=N)": 1448,
      "C11H10": 1449,
      "C(F)(F)F)cc1": 1450,
      "C18H15": 1451,
      "COc1cccc(": 1452,
      "CN)": 1453,
      "c5cc": 1454,
      "cn2)cc1": 1455,
      "c2ccccc21)": 1456,
      "c3ccc(F)cc3": 1457,
      "CCOCC1)": 1458,
      "c2ccs": 1459,
      "c1ccc(S(=O)(=O)N": 1460,
      "[C@H](N)": 1461,
      "CCNS(=O)(=O)": 1462,
      "o1)": 1463,
      "C(CN)": 1464,
      "(C(=O)OC)": 1465,
      "N=C(N)": 1466,
      "COc1ccc2c(c1)": 1467,
      "[C@@H](CC": 1468,
      "C25H29": 1469,
      "Cc1ccc(S(=O)(=O)N": 1470,
      ")NC1": 1471,
      "O=C(NC1": 1472,
      "CCC(O": 1473,
      "CCN(CC(=O)N": 1474,
      "C13H11": 1475,
      "CO1": 1476,
      "N4O3S2": 1477,
      "C21H29": 1478,
      "c3cccc(F)": 1479,
      "C9H12": 1480,
      "C10H19": 1481,
      "CC1CC1": 1482,
      "c(O)c1": 1483,
      "N)cc1": 1484,
      "(C)CC": 1485,
      "C(C)C)cc1": 1486,
      "Cc1cccc(C": 1487,
      "c1no": 1488,
      "COc1ccc(C(=O)N": 1489,
      "COc1ccc(Cl)cc1": 1490,
      "c2c(F)cccc2": 1491,
      "CCC[C@H]1": 1492,
      "(C)(C)C)": 1493,
      "c3ncn": 1494,
      "O5S": 1495,
      "[C@@](C)": 1496,
      "C11H22": 1497,
      "=C\\": 1498,
      "c2cccc(Cl)c2)": 1499,
      "COCCO": 1500,
      "N3O6S": 1501,
      "c2ncccc2": 1502,
      "C3CC3)": 1503,
      "cs2)": 1504,
      "F2N2O2": 1505,
      "C9H16": 1506,
      "C20H16": 1507,
      "FN4O2": 1508,
      "[C@@H](CO)": 1509,
      "[S": 1510,
      ")ccc1Cl": 1511,
      "F3NO": 1512,
      "c1ccc(S(=O)(=O)": 1513,
      "c(=O)o": 1514,
      "C13H25": 1515,
      "F3N2O3": 1516,
      "c2ccco2)": 1517,
      "C25H30": 1518,
      "C18H14": 1519,
      "c(C)cc(C)": 1520,
      "c2C)cc1": 1521,
      "C(C)C(=O)N": 1522,
      "c1ccccc1F)": 1523,
      "c3ccc(OC": 1524,
      "CC(C)N1": 1525,
      "Cc1cccnc1": 1526,
      "(C)C3": 1527,
      "CCCC2)": 1528,
      "c1cccc(C)c1": 1529,
      "C24H23": 1530,
      "c4cn": 1531,
      "c([N+](=O)[O-])": 1532,
      "CC(C)=": 1533,
      "CC[C@]2": 1534,
      "c(=O)[nH]1": 1535,
      "CCCC3": 1536,
      "c1ccc(OC": 1537,
      "[N+]=": 1538,
      "c2ccc(-c3cc": 1539,
      "[C@@H](NC(=O)": 1540,
      "C20H30": 1541,
      "c2ccccc2n1": 1542,
      "C(F)(F)C(F)(F)": 1543,
      "COc1cc(C": 1544,
      "CCCCCCCCCCCC": 1545,
      "ncc3": 1546,
      "FN4O": 1547,
      "Cc1cccc(NC(=O)": 1548,
      "c2C1": 1549,
      "c3cccc4": 1550,
      "C(C)C1": 1551,
      "cn3": 1552,
      "C16H13": 1553,
      "CCN(C(=O)N": 1554,
      "H42": 1555,
      "C24H31": 1556,
      "[C@H]4": 1557,
      "[nH]c2c1": 1558,
      "Cc1ccccc1)": 1559,
      ")N(C": 1560,
      "N6O3S": 1561,
      "c(CO": 1562,
      "F2N2O": 1563,
      "c1cc(C(=O)N": 1564,
      "F3NO2": 1565,
      "/C=C(/": 1566,
      "C13H26": 1567,
      "C=O)": 1568,
      "SCC(=O)N": 1569,
      "c(C(C)(C)C)": 1570,
      "c1ccc(OC)": 1571,
      "CC(C)(C)C": 1572,
      "[C@]3": 1573,
      "C16H28": 1574,
      "C9H15": 1575,
      "C12H10": 1576,
      "(Cl)n": 1577,
      "oc1": 1578,
      "CCCC(": 1579,
      "c(S(=O)(=O)N": 1580,
      "C21H30": 1581,
      "CCS(=O)(=O)C1": 1582,
      "c3ccccc3F)": 1583,
      "c2cccc(-": 1584,
      "COc1ccc(N": 1585,
      "CN(C)C": 1586,
      "(C)=O)": 1587,
      "O=c1": 1588,
      "c2cc3c(": 1589,
      "CC[C@H](C)": 1590,
      "CC[C@@]2": 1591,
      "C14H11": 1592,
      "C20H29": 1593,
      "c2ccc(C(=O)": 1594,
      "C)n1": 1595,
      "C22H18": 1596,
      "[N+]=[N-]": 1597,
      "n2-": 1598,
      "C19H29": 1599,
      "N2CCCC2)": 1600,
      "nc(NC(=O)": 1601,
      "Cl2F": 1602,
      "c3cccs3)": 1603,
      "c2nc(N": 1604,
      "[C@](C)": 1605,
      "c1c(F)cccc1": 1606,
      "Cc1cc(C(=O)N": 1607,
      "c1cccs1)": 1608,
      "c(N2": 1609,
      "c1cc(F)ccc1": 1610,
      "CCN(C2": 1611,
      "c2ccc(OC)": 1612,
      "CC(CO)": 1613,
      "C10H20": 1614,
      "C18H29": 1615,
      "CC(=O)N2": 1616,
      "(=N)": 1617,
      "CC(C)NC(=O)": 1618,
      "NC(": 1619,
      "[C@@]12": 1620,
      "(OC(C)=O)": 1621,
      "(=O)[nH]": 1622,
      "C21H17": 1623,
      "C2(": 1624,
      "COCC1": 1625,
      "c2nnc(-": 1626,
      "O=c1[nH]": 1627,
      "C9H11": 1628,
      "c(C(N)=O)": 1629,
      "nc1-": 1630,
      "CCCc1n": 1631,
      "N2O7": 1632,
      "C9H13": 1633,
      "N3CCCC3)": 1634,
      "F2NO": 1635,
      "C=C(C": 1636,
      "CCC2)": 1637,
      "c(O)cc": 1638,
      "/N=C(": 1639,
      "Cc1cc(NC(=O)": 1640,
      "(NS(=O)(=O)": 1641,
      "cc21": 1642,
      "c1ccccc1NC(=O)": 1643,
      "/C=C2\\": 1644,
      ")ccc1F": 1645,
      "Cc1nc(-": 1646,
      "C15H28": 1647,
      "C16H12": 1648,
      "CCN(C)C)": 1649,
      "OC3": 1650,
      "(c1ccccc1)": 1651,
      "CNC(": 1652,
      "(C3": 1653,
      "c1cccc([N+](=O)[O-])c1": 1654,
      "CCCO2)": 1655,
      "c1=O)": 1656,
      "c1cccc2c1": 1657,
      "c1cccc(C(=O)N": 1658,
      "C24H21": 1659,
      "O=C(CO": 1660,
      "c1ccccc1)N1": 1661,
      "c3cc4": 1662,
      "c(Cl)c(Cl)": 1663,
      "c1ccc(S": 1664,
      "cnc2": 1665,
      "OCO3)": 1666,
      "C24H32": 1667,
      "C(=O)OCC": 1668,
      "c2cccc(F)c2)": 1669,
      "C26H28": 1670,
      "ncc3)": 1671,
      "CCCN(C)": 1672,
      "nn3": 1673,
      "O=S(=O)(N": 1674,
      "n[nH]1": 1675,
      "N2CCC3": 1676,
      "C=CCO": 1677,
      "[C@H](CC": 1678,
      "C/C(=C\\": 1679,
      "C23H20": 1680,
      "C9H10": 1681,
      "4(C)": 1682,
      "H7Cl": 1683,
      "c2cc(C(=O)N": 1684,
      "C2CC2)cc1": 1685,
      "F3N4O": 1686,
      "CN1CCN(": 1687,
      "S(C)(=O)=O)cc1": 1688,
      "Nc1cc": 1689,
      "C2CCO": 1690,
      "N(C)C": 1691,
      "C(=C)": 1692,
      "(F)c1)": 1693,
      "c(=O)n1": 1694,
      "CC1(O)": 1695,
      "CCC(CC": 1696,
      "OC(C)(C)C": 1697,
      "n2)C1": 1698,
      "C23H31": 1699,
      "C9H17": 1700,
      "C26H26": 1701,
      "cnc1)": 1702,
      "N)c1": 1703,
      "CCC(C(=O)O)": 1704,
      "c2ccc(C)cc2)": 1705,
      "C15H27": 1706,
      "COc1cc(C)": 1707,
      "Cc1cc(C(=O)": 1708,
      "c1cc2c(": 1709,
      "c(F)c2)": 1710,
      "O8": 1711,
      "c2cccnc2)": 1712,
      "Cc1cc(C)cc": 1713,
      "Cc1ccc(C2": 1714,
      "CC4)n": 1715,
      "CNC(C)": 1716,
      "c2cccc3cccc": 1717,
      "NO7": 1718,
      "c2ccc(OC)cc2)": 1719,
      "c2n[nH]": 1720,
      "NO6S": 1721,
      "Cc2ccccc2)": 1722,
      "N4O6": 1723,
      "N4CCCC": 1724,
      "c3cc(Cl)cc": 1725,
      "c3c(c2": 1726,
      "c2=O)cc1": 1727,
      "NC(=S)N": 1728,
      "cccn": 1729,
      "c3cc(": 1730,
      "CCOC(=O)c1": 1731,
      "c2ccc3ccccc3": 1732,
      "Cl2N2O2": 1733,
      "=C(O)": 1734,
      "C1O": 1735,
      "C26H30": 1736,
      "CC1CCCC": 1737,
      "n2nn": 1738,
      "c3o": 1739,
      "c1ccc(F)c(F)c1": 1740,
      "C)CC1": 1741,
      "CCCn1cc": 1742,
      "c(F)cc1": 1743,
      ")c1ccccc1": 1744,
      ")C(=O)O": 1745,
      "O=C(CN1": 1746,
      "I)c1": 1747,
      "C19H30": 1748,
      "C25H31": 1749,
      "c2nc(C": 1750,
      "CCC2(CC1)": 1751,
      "COCCN": 1752,
      "4)CC3)": 1753,
      "=CC(=O)": 1754,
      "C14H27": 1755,
      "([N+](=O)[O-])": 1756,
      "(CC)CC": 1757,
      "c1ccc2c(c1": 1758,
      "C=CC1": 1759,
      "C10H9": 1760,
      "(C(C)=O)": 1761,
      "c1ccccc1-": 1762,
      "c2Cl)": 1763,
      "CCCCC2": 1764,
      "c1ccc(O)": 1765,
      "CCc2ccccc2": 1766,
      "c1cc2c(cc1": 1767,
      "S1(=O)": 1768,
      "F3N4O2": 1769,
      "CCCCC3": 1770,
      "c(N)c1": 1771,
      "c(OCC": 1772,
      "O[C@@H]1": 1773,
      "C2=O)c1": 1774,
      "C[C@@H](NC(=O)": 1775,
      "C26H27": 1776,
      "c2ccc(N3": 1777,
      "OCc1ccccc1)": 1778,
      "N2CCOCC2)cc1": 1779,
      "C14H28": 1780,
      "c2cc(Cl)": 1781,
      "Cc1cccc(C)c1": 1782,
      "COc1ccc(C)cc1": 1783,
      "Nc1": 1784,
      "F3N3O3": 1785,
      "Cc2cn": 1786,
      "CC[C@@H](C)": 1787,
      "C19H15": 1788,
      "B(O)": 1789,
      ")cc2c1": 1790,
      "C23H19": 1791,
      "C=CCn1": 1792,
      "COCCN1": 1793,
      "CCCCNC(=O)": 1794,
      "F3NO3": 1795,
      "C8H14": 1796,
      "c3ccc(C)cc3)": 1797,
      "c2cc(F)": 1798,
      "C13H10": 1799,
      "c4ccc(F)cc": 1800,
      "c2ccc(C#N": 1801,
      "N5O5": 1802,
      "[C-]": 1803,
      "I)cc1": 1804,
      "N6O4": 1805,
      "c2nc(C)": 1806,
      "c3ccco3)": 1807,
      "CS(=O)(=O)N": 1808,
      "C1(": 1809,
      ")C(=O)N": 1810,
      "c3ccccc32)cc1": 1811,
      "c1cc(Cl)cc": 1812,
      "3)C1)": 1813,
      "C26H29": 1814,
      "[Si](C)(C)C)": 1815,
      ")N(C)": 1816,
      "CCC[C@@H]1": 1817,
      "C8H12": 1818,
      "OC(C)=O)": 1819,
      "nnc1": 1820,
      "c1cc2cc": 1821,
      "CC1C": 1822,
      "SC)": 1823,
      "C18H30": 1824,
      "COc1cccc2": 1825,
      "C26H25": 1826,
      "O=C(C1": 1827,
      "c1cccc(C(F)(F)F)c1": 1828,
      "F2NO2": 1829,
      "c3c(C)": 1830,
      ")cc(-": 1831,
      "N3OS2": 1832,
      "c1ccc2c(c1)OCO2": 1833,
      "OCc2ccccc2)": 1834,
      "c2cccc([N+](=O)[O-])": 1835,
      "c1ccco1)": 1836,
      "C25H32": 1837,
      ")N1CCN(": 1838,
      "c1ccc2ccccc2c1": 1839,
      "(C1)": 1840,
      "[C@@H](O)[C@H](O)": 1841,
      "CCO2": 1842,
      ")cc(OC)c1OC": 1843,
      "cn2)CC1": 1844,
      "CCN(CC(=O)": 1845,
      "NO3S2": 1846,
      "c1ccsc1": 1847,
      "C9H18": 1848,
      "/C=C/C(=O)N": 1849,
      "F2N3O2": 1850,
      "c2nc(": 1851,
      "C17H29": 1852,
      "CNc1n": 1853,
      "(C(=O)O": 1854,
      "nc2)": 1855,
      "CNCC1": 1856,
      "c3ccc(O": 1857,
      "C31": 1858,
      "CC(CN)": 1859,
      "C26H24": 1860,
      "=C(C": 1861,
      "FN3": 1862,
      "c2ccc(C(C)": 1863,
      "H41": 1864,
      "CCC=": 1865,
      "c1ccccc1)C(=O)": 1866,
      "CC(C)(C)OC(=O)": 1867,
      "C11H9": 1868,
      "CC(CN": 1869,
      "C=C/": 1870,
      "OCC(O)": 1871,
      "CCN(CC)C(=O)": 1872,
      "C1CC1)": 1873,
      "c1ncc(-": 1874,
      "CC5": 1875,
      "CC(C)(C)C)": 1876,
      "Cc1nc(": 1877,
      "CCNC(": 1878,
      "CC(C)(C)N": 1879,
      "FN2": 1880,
      "OC(C)C": 1881,
      "cnc3": 1882,
      "C25H22": 1883,
      "S(N)(=O)=O)": 1884,
      "C15H11": 1885,
      "c3nc4ccccc4": 1886,
      "CCc2c(": 1887,
      "c1ccc(Cl)cc1Cl": 1888,
      "c2c(-": 1889,
      "COc1cccc(-": 1890,
      "C17H13": 1891,
      "CN3": 1892,
      "#[N+]": 1893,
      "(C)C)cc2)": 1894,
      "n3cn": 1895,
      "c1ccc(N)cc1": 1896,
      "[C-]#[N+]": 1897,
      "Cc1noc(C)c1": 1898,
      "=NO": 1899,
      "c2ccncc2": 1900,
      "C23H32": 1901,
      "CCNC(=O)N": 1902,
      "C9H9": 1903,
      "N2O5S2": 1904,
      "C2CC3": 1905,
      "NC(=O)N1": 1906,
      "C22H31": 1907,
      "COc1cc2c(cc1": 1908,
      "CCc1cn": 1909,
      "(OCC)": 1910,
      "c2cc3cccc": 1911,
      "CCCCC2)": 1912,
      "COC": 1913,
      "COc1cccc(C": 1914,
      "c2ccc(Cl)cc2)cc1": 1915,
      "H44": 1916,
      "C2=N": 1917,
      "O=C(/C=C/": 1918,
      "[C@H](C(=O)N": 1919,
      "C12CC3": 1920,
      "[C@@H](C)C(=O)N": 1921,
      "C14H10": 1922,
      "F2N2O3": 1923,
      "c2ccc(C(=O)O)": 1924,
      "nc(C2": 1925,
      "N3CCCC3": 1926,
      "CNC(=O)N": 1927,
      "C(C)CC": 1928,
      "(F)F": 1929,
      "c4)n": 1930,
      "PS": 1931,
      "c1ccccn1)": 1932,
      "C(=O)OC(C)(C)C)": 1933,
      "=C)": 1934,
      "C25H23": 1935,
      "O[C@H]1": 1936,
      "nc1C": 1937,
      "c3cccc(C)": 1938,
      "(C=O)": 1939,
      "N2OS2": 1940,
      "FN5O": 1941,
      "s2)c1": 1942,
      "CCOC(=O)C1=": 1943,
      "O)cc2)": 1944,
      "N8O": 1945,
      "c2ccc(C3": 1946,
      "CCC(CN": 1947,
      "/C(C#N)": 1948,
      "@]": 1949,
      "c1Cl": 1950,
      "[nH]2)": 1951,
      "(CC2)": 1952,
      "O)C1": 1953,
      "[nH]1)": 1954,
      "n2ccnc2": 1955,
      "nc(C(=O)N": 1956,
      "C/C=C(\\": 1957,
      "Cc1cccc(O": 1958,
      "c2nnc(C": 1959,
      "Cc1nc(C": 1960,
      "CC(F)(F)F)": 1961,
      "c2nc3c(": 1962,
      "c2ccc(C)cc2": 1963,
      "N3CCCCC3)": 1964,
      "N=C1": 1965,
      "OCCO": 1966,
      "C8H13": 1967,
      "C[C@]12": 1968,
      "C21H16": 1969,
      "c4ccccc43)": 1970,
      "CNC(C": 1971,
      "Cc1ccco1": 1972,
      "-2": 1973,
      "Cc1cc(O": 1974,
      "(C(=O)N2": 1975,
      "[nH]c1": 1976,
      "n2c1": 1977,
      ")ccc2c1": 1978,
      "C/C(=N": 1979,
      "O=S(=O)(": 1980,
      "c1nc2c(": 1981,
      "CC1(C)O": 1982,
      "c2ccc([N+](=O)[O-])cc2)": 1983,
      "FN2O4": 1984,
      "P(=O)(O)O": 1985,
      "CN(CC(=O)N": 1986,
      "c4n": 1987,
      "=NC(=O)": 1988,
      "C22H32": 1989,
      "C3)cc1": 1990,
      "c(-c4ccccc4": 1991,
      "C1CCN(C(=O)": 1992,
      "N4OS2": 1993,
      "c4c3": 1994,
      "c3ccccc3Cl)": 1995,
      "CC1CCCCC1": 1996,
      "c1ccccc1Cl)": 1997,
      "COC(=O)c1": 1998,
      "(O)c1": 1999,
      "#C": 2000,
      "Cc1ccc(Cl)": 2001,
      "CCCN3": 2002,
      "Cn2": 2003,
      "F3N2": 2004,
      "nc21": 2005,
      "nc2n1": 2006,
      "CCOc1cc": 2007,
      "F2N3O": 2008,
      "CO2": 2009,
      "C1(C)": 2010,
      "Cl2N2O": 2011,
      "Cc1nc(N": 2012,
      "C19H14": 2013,
      "=C(C)": 2014,
      "OCC2": 2015,
      "c6": 2016,
      "(C2CC2)": 2017,
      "c2nnc(S": 2018,
      "C(c2ccccc2)": 2019,
      "C2CC": 2020,
      "c3cccc(Cl)c3)": 2021,
      "C26H32": 2022,
      "Cc1cccc(N": 2023,
      "C8H10": 2024,
      "[C@H](C)C(=O)N": 2025,
      "C26H31": 2026,
      "CC(=O)N(C": 2027,
      "OC(C)C)": 2028,
      "C8H15": 2029,
      ")ccc1OC": 2030,
      "c2nnn": 2031,
      "Cl2N2O3": 2032,
      "NO2S2": 2033,
      "Cc1ccc(F)": 2034,
      "cs2)cc1": 2035,
      "N4O4S2": 2036,
      "c2ccc3n": 2037,
      "C[C@H](N": 2038,
      "NO4S2": 2039,
      "CC(=O)N(C)": 2040,
      "C21H32": 2041,
      "c1ccc(C#N)cc1": 2042,
      ")ccc1N": 2043,
      "cn2)c1": 2044,
      "(O)cc": 2045,
      "c2ccc(F)cc2)cc1": 2046,
      "(C(=O)N3": 2047
    },
    "merges": [
      [
        "c",
        "c"
      ],
      [
        "C",
        "C"
      ],
      [
        "(",
        "C"
      ],
      [
        "O",
        ")"
      ],
      [
        "c",
        "1"
      ],
      [
        "=",
        "O)"
      ],
      [
        "(",
        "=O)"
      ],
      [
        "C",
        "1"
      ],
      [
        "c",
        "2"
      ],
      [
        "(C",
        ")"
      ],
      [
        "c1",
        "cc"
      ],
      [
        "c",
        "("
      ],
      [
        "C",
        "2"
      ],
      [
        "C",
        "(=O)"
      ],
      [
        "H",
        "2"
      ],
      [
        "H",
        "1"
      ],
      [
        "H",
        "]"
      ],
      [
        ")",
        "cc"
      ],
      [
        "c2",
        "cc"
      ],
      [
        "N",
        "2"
      ],
      [
        "[",
        "C"
      ],
      [
        "[C",
        "@"
      ],
      [
        "c",
        "3"
      ],
      [
        "C",
        "("
      ],
      [
        "F",
        ")"
      ],
      [
        "O",
        "2"
      ],
      [
        "c",
        "(C"
      ],
      [
        "CC",
        "CC"
      ],
      [
        "N",
        "3"
      ],
      [
        "C",
        "l"
      ],
      [
        "O",
        "3"
      ],
      [
        "c1cc",
        "cc"
      ],
      [
        "C",
        "O"
      ],
      [
        "C",
        "N"
      ],
      [
        "CC",
        "1"
      ],
      [
        "2",
        ")"
      ],
      [
        "CC",
        "N"
      ],
      [
        ")cc",
        "1"
      ],
      [
        "[C@",
        "@"
      ],
      [
        "C",
        ")"
      ],
      [
        "n",
        "1"
      ],
      [
        "c2cc",
        "cc"
      ],
      [
        "c1cc",
        "c("
      ],
      [
        "C",
        "(C)"
      ],
      [
        "[C@",
        "H]"
      ],
      [
        "[C@@",
        "H]"
      ],
      [
        "c3",
        "cc"
      ],
      [
        "N",
        "4"
      ],
      [
        "c",
        "n"
      ],
      [
        "N",
        ")"
      ],
      [
        "N",
        "C(=O)"
      ],
      [
        "(=O)",
        "N"
      ],
      [
        "(",
        "F)"
      ],
      [
        "O",
        "4"
      ],
      [
        "c1cccc",
        "c1"
      ],
      [
        "C",
        "="
      ],
      [
        "c2cccc",
        "c2"
      ],
      [
        "CC",
        "O"
      ],
      [
        "c1",
        "n"
      ],
      [
        "CC",
        "(C)"
      ],
      [
        "3",
        ")"
      ],
      [
        "O",
        "="
      ],
      [
        "C(=O)",
        "N"
      ],
      [
        "S",
        "(=O)"
      ],
      [
        "(",
        "CC"
      ],
      [
        "c(C",
        "l"
      ],
      [
        "H",
        "3"
      ],
      [
        "CC",
        "C"
      ],
      [
        "c",
        "(C)"
      ],
      [
        "[",
        "n"
      ],
      [
        "[n",
        "H]"
      ],
      [
        "C",
        "c1cc"
      ],
      [
        "(C",
        "(=O)"
      ],
      [
        "c",
        "4"
      ],
      [
        "N2",
        "O"
      ],
      [
        "O",
        "C"
      ],
      [
        "(",
        "O)"
      ],
      [
        "c3cc",
        "cc"
      ],
      [
        "C1",
        "5"
      ],
      [
        "C1",
        "4"
      ],
      [
        "N",
        "5"
      ],
      [
