{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Split",
        "pattern": {
          "String": "(\\[[^\\]]+]|Br?|Cl?|N|O|S|P|F|I|b|c|n|o|s|p|\\(|\\)|\\.|=|#|-|\\+|\\\\|\\/|:|~|@|\\?|>>?|\\*|\\$|\\%[0-9]{2}|[0-9])"
        },
        "behavior": "Isolated",
        "invert": false
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "#": 4,
      "%": 5,
      "(": 6,
      ")": 7,
      "+": 8,
      "-": 9,
      "/": 10,
      "0": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "7": 18,
      "8": 19,
      "9": 20,
      "=": 21,
      "@": 22,
      "B": 23,
      "C": 24,
      "F": 25,
      "H": 26,
      "I": 27,
      "L": 28,
      "M": 29,
      "N": 30,
      "O": 31,
      "P": 32,
      "S": 33,
      "[": 34,
      "\\": 35,
      "]": 36,
      "a": 37,
      "b": 38,
      "c": 39,
      "e": 40,
      "g": 41,
      "i": 42,
      "l": 43,
      "n": 44,
      "o": 45,
      "p": 46,
      "s": 47,
      "cc": 48,
      "CC": 49,
      "(C": 50,
      "O)": 51,
      "c1": 52,
      "=O)": 53,
      "(=O)": 54,
      "c2": 55,
      "(C)": 56,
      "c1cc": 57,
      "c(": 58,
      "C(=O)": 59,
      "H]": 60,
      ")cc": 61,
      "c2cc": 62,
      "[C": 63,
      "[C@": 64,
      "CCC": 65,
      "c3": 66,
      "F)": 67,
      "c(C": 68,
      "=C": 69,
      "2)": 70,
      "OC": 71,
      "c1cccc": 72,
      "C1": 73,
      "CC1": 74,
      "CCN": 75,
      "(N": 76,
      "(C)C": 77,
      ")cc1": 78,
      "(F)": 79,
      "[C@@": 80,
      "n1": 81,
      "(=O)N": 82,
      "CO": 83,
      "c2cccc": 84,
      "c1ccc(": 85,
      "[C@H]": 86,
      "[C@@H]": 87,
      "CCCC": 88,
      "c3cc": 89,
      "cn": 90,
      "CN": 91,
      "C(=O)N": 92,
      "c1ccccc1": 93,
      "c2ccccc2": 94,
      "l)": 95,
      "3)": 96,
      "(O)": 97,
      "(CC": 98,
      "c1n": 99,
      "CCO": 100,
      "S(=O)": 101,
      "NC(=O)": 102,
      "O=C": 103,
      "c1ccc(C": 104,
      "c(C)": 105,
      "[n": 106,
      "[nH]": 107,
      "C2": 108,
      "CC(C)": 109,
      "c4": 110,
      "N)": 111,
      "c3cccc": 112,
      "(C(=O)": 113,
      "C=C": 114,
      ")N": 115,
      "c2n": 116,
      "(F)(F)": 117,
      "(N)": 118,
      "c(-": 119,
      "cc1": 120,
      "(C)C)": 121,
      "C(": 122,
      "n2": 123,
      "c(N": 124,
      "CCCN": 125,
      "Cc1cc": 126,
      "F)cc": 127,
      "C(C)": 128,
      "S(=O)(=O)": 129,
      "c3ccccc3": 130,
      "c2)": 131,
      "1CC": 132,
      "OC)": 133,
      "=N": 134,
      "[N": 135,
      "CC(=O)N": 136,
      "2)cc1": 137,
      "-]": 138,
      "+]": 139,
      "l)cc": 140,
      "=O": 141,
      "(-": 142,
      "[N+]": 143,
      "c2ccc(": 144,
      "CCC1": 145,
      "[O": 146,
      "2CC": 147,
      "[O-]": 148,
      "c2ccccc2)": 149,
      "cccc": 150,
      "C)": 151,
      "(C(=O)N": 152,
      "cs": 153,
      "c(=O)": 154,
      "c1)": 155,
      "(Cl)": 156,
      "/C=C": 157,
      "(=O)[O-]": 158,
      "2)c1": 159,
      "[N+](=O)[O-]": 160,
      "c2ccc(C": 161,
      "c2c(": 162,
      "[C@@H]1": 163,
      "OCC": 164,
      "2C": 165,
      "[C@H]1": 166,
      "Cc1ccc(": 167,
      "c1cn": 168,
      "c1C": 169,
      "S(=O)(=O)N": 170,
      "(F)(F)F)": 171,
      "(NC(=O)": 172,
      "COC(=O)": 173,
      "Cc1n": 174,
      "CC(=O)": 175,
      "4)": 176,
      "#N)": 177,
      "CC2)": 178,
      "nn": 179,
      "C(=O)O": 180,
      "CCN(": 181,
      "c(Cl)": 182,
      "1)": 183,
      "(CN": 184,
      "CC2": 185,
      "(CC)": 186,
      "COc1cc": 187,
      "C=": 188,
      "3CC": 189,
      "OC(C)": 190,
      "c1ccccc1)": 191,
      "F)cc1": 192,
      "1CCC": 193,
      "COc1ccc(": 194,
      "O=C(N": 195,
      "ncc": 196,
      "(O": 197,
      "CC(C)(C)": 198,
      "(C(=O)O)": 199,
      "l)cc1": 200,
      "CS": 201,
      "CCOC(=O)": 202,
      "cn1": 203,
      "c3)": 204,
      "c(F)": 205,
      "=S": 206,
      "2CCC": 207,
      "C[C@H]": 208,
      "c2c1": 209,
      "2)CC1": 210,
      "o1": 211,
      "2)C1": 212,
      "3)cc": 213,
      "Cc1": 214,
      "c12": 215,
      "c3ccccc3)": 216,
      "C[C@@H]": 217,
      "N1": 218,
      "Cl)": 219,
      "[C@]": 220,
      "Cl": 221,
      "/C=C/": 222,
      "Cc1cccc": 223,
      "c4cccc": 224,
      "C1CC": 225,
      "C(C": 226,
      "CCN(C(=O)": 227,
      "CCN1": 228,
      "CCN(C": 229,
      "N=C": 230,
      "(=O)O)": 231,
      "CCCO": 232,
      "[C@@]": 233,
      "s1": 234,
      "c(Cl)cc": 235,
      "c2cn": 236,
      "c3c(": 237,
      "n1cc": 238,
      "Cc1ccc(C": 239,
      "c(C)cc": 240,
      "[N+](=O)[O-])": 241,
      "nc1": 242,
      "c2c(c1)": 243,
      "c4cc": 244,
      "CN1": 245,
      "C(C)C": 246,
      "OC1": 247,
      "(CO)": 248,
      "2CCCC": 249,
      "c1ccc(N": 250,
      "O=C(O)": 251,
      "CCCCC": 252,
      "c3ccc(": 253,
      "3)n": 254,
      "CC1)": 255,
      "c1ncc": 256,
      "C(=O)O)": 257,
      "(OC)": 258,
      "Cc1ccccc1": 259,
      "CC(C)C": 260,
      "c3n": 261,
      "[C@H]2": 262,
      "C3": 263,
      "COc1ccc(C": 264,
      "[C@@H]2": 265,
      "c(N)": 266,
      "c1ccc(-": 267,
      "C(=C": 268,
      "CCC(C)": 269,
      "(Cl)cc": 270,
      "CCNC(=O)": 271,
      "c(C(=O)N": 272,
      "OC(=O)": 273,
      "c4ccccc4": 274,
      "C2)": 275,
      "(N)=O)": 276,
      "co": 277,
      "CN(C)": 278,
      "C(F)(F)": 279,
      "c1nn": 280,
      "O=": 281,
      "N#": 282,
      "(OC": 283,
      "[C@H](C)": 284,
      "n3": 285,
      "c1ccc(Cl)cc1": 286,
      "CC(": 287,
      "[C@@H](C)": 288,
      "c2ccc(Cl)cc": 289,
      "CCCCCCCC": 290,
      "c2ccc(F)cc": 291,
      "c(S": 292,
      "(=O)=O)": 293,
      "[S": 294,
      ")ccc1": 295,
      "O=C(": 296,
      "C(=O)N1": 297,
      "(F)cc": 298,
      "(CC(=O)N": 299,
      "nc2": 300,
      "c[nH]": 301,
      "(C(F)(F)F)": 302,
      "O=C(C": 303,
      "#N": 304,
      "S(C)": 305,
      "c1ccc(F)cc1": 306,
      "CNC(=O)": 307,
      "C(=N": 308,
      "c1ccc2c(c1)": 309,
      "2)n1": 310,
      "CCOCC": 311,
      "n(C)": 312,
      "c2ncc": 313,
      "c(C)c1": 314,
      "COC": 315,
      "(CCC": 316,
      "COc1cccc": 317,
      "(C)CC": 318,
      "=CC": 319,
      "(C#N)": 320,
      "CCC2": 321,
      "[Si": 322,
      "c5": 323,
      "C(N)": 324,
      "cc2": 325,
      "C(O)": 326,
      "Cn1": 327,
      "c2ccccc21": 328,
      "CC(O)": 329,
      "c(O)": 330,
      "O=C1": 331,
      ")cc2": 332,
      "c(OC)": 333,
      ")N1": 334,
      "C1=O": 335,
      "c21": 336,
      "/C(=C": 337,
      "cs1": 338,
      "c(NC(=O)": 339,
      "c2)cc1": 340,
      "c1ccn": 341,
      "c(=O)[nH]": 342,
      "C(=S": 343,
      "2)n": 344,
      "(C(C)": 345,
      "O1": 346,
      "c1cc2": 347,
      "[C@H](O)": 348,
      "CN(": 349,
      "=O)cc1": 350,
      "[Si]": 351,
      "c(-c3cc": 352,
      "C1CC1": 353,
      "c2nn": 354,
      "[C@@H](O)": 355,
      "N2": 356,
      "CN(C": 357,
      "CCn1": 358,
      "cnc1": 359,
      "CC2)cc1": 360,
      "(C)cc": 361,
      "(F)(F)F)cc": 362,
      "n2cc": 363,
      "CCN(CC": 364,
      "[C@@H](": 365,
      "n1)": 366,
      "CCCN1": 367,
      "CC1CC": 368,
      "C(C)(C)C": 369,
      "n2)cc1": 370,
      "c(-c2cc": 371,
      "C[C@@H]1": 372,
      "NC(=O)N": 373,
      "CCC(=O)N": 374,
      "[C@@H]3": 375,
      "COc1ccccc1": 376,
      "Cc1cn": 377,
      "Cc2cc": 378,
      "c(F)cc": 379,
      "c1=O": 380,
      "c(C)cc1": 381,
      "C#": 382,
      "(C)(C)C": 383,
      "[C@H](": 384,
      "c(CN": 385,
      "C1=C": 386,
      "[nH]1": 387,
      "S(C)(=O)=O)": 388,
      "OCO": 389,
      "3)cc1": 390,
      "c23)": 391,
      "c1Cl": 392,
      "O)cc1": 393,
      "c2ccccc2)cc1": 394,
      "CCS": 395,
      "C[C@H]1": 396,
      "nc(N": 397,
      "(C)C(=O)": 398,
      "OCCO": 399,
      "(CN)": 400,
      "OC(C)(C)C)": 401,
      "CCN(CC)": 402,
      "[C@H]3": 403,
      "C(=S)N": 404,
      "(/": 405,
      "CN(C(=O)": 406,
      "C(C)C)": 407,
      "n2)": 408,
      "c2s": 409,
      "c1cccc2": 410,
      "c1ccc(OC": 411,
      "c2ccc(N": 412,
      "c3c(c2)": 413,
      "[C@]1": 414,
      "n(-": 415,
      "c(F)c1": 416,
      "2C(=O)": 417,
      "c(Cl)c1": 418,
      "CC)": 419,
      "CC(C)N": 420,
      "CCCC1": 421,
      "=C(N": 422,
      "CC3)": 423,
      "C=N": 424,
      "c1-": 425,
      "O)cc": 426,
      "c1ccc(Cl)": 427,
      "(\\": 428,
      "(S": 429,
      "CCOCC1": 430,
      "C3)": 431,
      "c2n1": 432,
      "c(C)n": 433,
      "c(OC": 434,
      "I)": 435,
      "/N=C": 436,
      "c3cn": 437,
      "1CCCC1": 438,
      "([N+](=O)[O-])": 439,
      "c1N": 440,
      "c3ccc(F)cc": 441,
      "3CCC": 442,
      "Cc1ccc(-": 443,
      "[C@@H](C": 444,
      "3CCCC": 445,
      "Cn1cc": 446,
      "n(C": 447,
      "C(C)(C)": 448,
      "/C=C\\": 449,
      "C1)": 450,
      "OCC)": 451,
      "2CCCCC": 452,
      "c2)c1": 453,
      "(F)F)": 454,
      "c1ccc(NC(=O)": 455,
      "CC(C)(C)O": 456,
      "OC(C)(C)C": 457,
      "4)cc": 458,
      "[C@H](C": 459,
      "21": 460,
      "(C)(C)": 461,
      "c(C(=O)O)": 462,
      "C(CC": 463,
      "C(F)(F)F": 464,
      "c1ccc(C(=O)N": 465,
      "C2=O)": 466,
      "n3)": 467,
      "c1OC": 468,
      "c2[nH]": 469,
      "C=CC": 470,
      "C1CCC": 471,
      "[N+](=O)[O-])cc": 472,
      "C(=O)OC": 473,
      "c2cccn": 474,
      "c2ccc(OC": 475,
      "c1O": 476,
      "=S)": 477,
      "=C1": 478,
      "[C@@]1": 479,
      "C1CCCCC1": 480,
      "c2ccc3c(c2)": 481,
      "1CCCCC1": 482,
      "4CC": 483,
      "(S(=O)(=O)N": 484,
      "CC2)c1": 485,
      "c1cccc(Cl)": 486,
      "c1cc(N": 487,
      "CC(=O)O": 488,
      "c(C(F)(F)F)": 489,
      "(c2ccccc2)": 490,
      "(C)(C)C)": 491,
      "C(F)(F)F)": 492,
      "nn1": 493,
      "CC1(C)": 494,
      "c1cc(-": 495,
      "CC(N": 496,
      "ncn": 497,
      "c1s": 498,
      "c(C(=O)": 499,
      "(C2": 500,
      "c2ccccc12": 501,
      "c2cc3": 502,
      "C2)cc1": 503,
      "CCOC": 504,
      "c2C": 505,
      "Cc1cc(C)": 506,
      "[N+](=O)[O-])cc1": 507,
      "c2cccc(Cl)": 508,
      "c1ncn": 509,
      "2)N": 510,
      "2Cl)": 511,
      "CCN1C(=O)": 512,
      "(CNC(=O)": 513,
      "c2)CC1": 514,
      "(C)N": 515,
      "(CCN": 516,
      "[O-])": 517,
      "nc3": 518,
      "COc1ccc(-": 519,
      "P(=O)": 520,
      "c3ccc(Cl)cc": 521,
      "OCC(=O)N": 522,
      "3CCCCC": 523,
      "(F)c1": 524,
      "c2C)": 525,
      "c2ncn": 526,
      "(C)C)cc": 527,
      "c4)": 528,
      "c4ccccc4)": 529,
      "(CC(=O)O)": 530,
      "CCCN(C(=O)": 531,
      "c1cs": 532,
      "CCN(C)": 533,
      "=N)": 534,
      "5)": 535,
      "(C(C)C)": 536,
      "c1ccc(F)": 537,
      "(CCCC": 538,
      "[C@]2": 539,
      "/C(=C\\": 540,
      "NS(=O)(=O)": 541,
      "nc(C": 542,
      "sc1": 543,
      "c2ccc(Cl)": 544,
      "(=O)=O": 545,
      "c1cc(Cl)cc": 546,
      "c4c(": 547,
      "c1ccc(C)cc1": 548,
      "NC1": 549,
      "(CCO)": 550,
      "2CCO": 551,
      "CCCNC(=O)": 552,
      "[C@H]1CC": 553,
      "[C@@]2": 554,
      "c1cc(C": 555,
      "CCNC(=N": 556,
      "co1": 557,
      "2CCN(": 558,
      "CC(N)": 559,
      "=O)cc": 560,
      "([O-])": 561,
      "nc(-": 562,
      "C(C)(C)C)": 563,
      "CCCN(": 564,
      "CCCC2": 565,
      "c2ccc(-": 566,
      "c1ccccc1)N": 567,
      "n1-": 568,
      "c(C#N)": 569,
      "c1cncc": 570,
      "Cc2ccccc2": 571,
      "c2cccc3": 572,
      "(F)(F)F)cc1": 573,
      "CN=C(N": 574,
      "c1cccs1": 575,
      "c2ccc(C)cc": 576,
      "c1nc(N": 577,
      "[C@@H]1CC": 578,
      "c2cccs": 579,
      "C(=O)N1CCC": 580,
      "CC(C": 581,
      "c2cccc(F)": 582,
      "c([N+](=O)[O-])": 583,
      "C=C1": 584,
      "c2cc(Cl)cc": 585,
      ")cc2)": 586,
      "c1ccc(O": 587,
      "c3ncc": 588,
      "(C)C)cc1": 589,
      "Cc1ccc(N": 590,
      "3CCOCC": 591,
      "2CCN": 592,
      "c2cs": 593,
      "O=S(=O)": 594,
      "c(OC)c1": 595,
      "c1cccc(N": 596,
      "c1[nH]": 597,
      "3)CC2)": 598,
      "/C=C(\\": 599,
      "c1cccnc1": 600,
      "c2)C1": 601,
      "c2=O)": 602,
      "COC1": 603,
      "CS(=O)(=O)": 604,
      "c(O": 605,
      "s1)": 606,
      "c2ccc(F)cc2)": 607,
      "cc3": 608,
      "c1cc(F)cc": 609,
      "c1ccc(S(=O)(=O)N": 610,
      "CCCCO": 611,
      "n2cn": 612,
      "C2)c1": 613,
      "CC1CCC": 614,
      "c1nc2ccccc2": 615,
      "c(CC": 616,
      "c1ccncc1": 617,
      "no": 618,
      "(c1ccccc1)": 619,
      "CCCCCC": 620,
      "(OC(=O)": 621,
      "CC(C)(C)C": 622,
      "OC2": 623,
      "c(C)c(C)": 624,
      "C#N)": 625,
      "c1ccc(CN": 626,
      "C1CCCC1": 627,
      "3)cc2": 628,
      "c(-c2ccccc2)": 629,
      "c2)n1": 630,
      "(C)c1": 631,
      "c2o": 632,
      "c2cc(-": 633,
      "c2ccc(Cl)cc2)": 634,
      "[nH]c(=O)": 635,
      "3CC3)": 636,
      "(CO": 637,
      "ncc2": 638,
      "C2CC2)": 639,
      "SC": 640,
      "CC(=O)N1": 641,
      "/C(=C/": 642,
      "C2=O)cc1": 643,
      "c1)N": 644,
      "C4": 645,
      "Cc1ncc": 646,
      "c1cc(": 647,
      "c(cc1": 648,
      "(NC(=O)N": 649,
      "CCCCC1": 650,
      "ncc1": 651,
      "c1nc(C": 652,
      "=C2": 653,
      "c1cccc(-": 654,
      "CC3": 655,
      "CC(C)O": 656,
      "n1C": 657,
      "CCNCC1": 658,
      "c2nc3ccccc3": 659,
      "CN1CCC": 660,
      "[C@H]1O": 661,
      "Cc1cc2": 662,
      "cccc2": 663,
      "CN(CC": 664,
      "CN1C(=O)": 665,
      "c3s": 666,
      "CC(C)(C)OC(=O)N": 667,
      "c2ccccc2)CC1": 668,
      "c2ccccc2)c1": 669,
      "[N+]([O-])": 670,
      "CC(NC(=O)": 671,
      "c2ccc(F)": 672,
      "c(SCC(=O)N": 673,
      "2CCOCC2)": 674,
      "c3ccc(F)cc3)": 675,
      "N(C": 676,
      "c1c[nH]": 677,
      "CC1=C": 678,
      "Cc1cc(N": 679,
      "CCn1cc": 680,
      "CCCCN": 681,
      "2)cc": 682,
      "(F)F": 683,
      "(C(C)(C)C)": 684,
      "c2ccccc2F)": 685,
      "c3nn": 686,
      "N1C(=O)": 687,
      "c3ccc(C": 688,
      "CCc1cc": 689,
      "c2F)": 690,
      "n1cn": 691,
      "[C@@H]2C": 692,
      "OC(C)=O)": 693,
      "c1cccc(F)c1": 694,
      "c2ccco": 695,
      "(C(N)=O)": 696,
      "c1c(F)cc": 697,
      "C2CCC": 698,
      "c2no": 699,
      "=C/": 700,
      "(C)C1": 701,
      "#N)cc": 702,
      "O=C(CC": 703,
      "=CCC": 704,
      "CN1CC": 705,
      "c2Cl)": 706,
      "c1ccc([N+](=O)[O-])cc1": 707,
      "C(=O)N(": 708,
      "S1": 709,
      "O=[N+]([O-])": 710,
      "CCc1n": 711,
      "s2)": 712,
      "c2ccccc2Cl)": 713,
      "c2cc(N": 714,
      "[C@@H]1O": 715,
      "CCCN(C": 716,
      "c2nc(-": 717,
      "c3cccn": 718,
      "CCN(S(=O)(=O)": 719,
      "(N)(=O)=O)": 720,
      "Cc1ccc(NC(=O)": 721,
      "no1": 722,
      "C(N": 723,
      "c2cc(F)cc": 724,
      "[C@H]2C": 725,
      "c12)": 726,
      "CC1(C)C": 727,
      "C(N)=N": 728,
      "S(C)(=O)=O": 729,
      "c1c(Cl)cc": 730,
      "[Si](C)(C)C": 731,
      "c(-c4cc": 732,
      "cn2": 733,
      "c2nc(C": 734,
      "c1F": 735,
      "(OCC": 736,
      "Cc1cs": 737,
      ")cc1)": 738,
      "/C(=N": 739,
      "(C)O": 740,
      "nc(C)": 741,
      "c2cc1": 742,
      "(F)(F)F": 743,
      "CCOc1ccccc1": 744,
      "c2cc(C": 745,
      "C(C#N)": 746,
      "c1cc(C)": 747,
      ")N1CCC": 748,
      "C2CCCC": 749,
      "Cc1no": 750,
      "n2)c1": 751,
      "cs1)": 752,
      "NC(=O)C1": 753,
      "CCc1ccccc1": 754,
      "[C@H](CO)": 755,
      "CCC(CC)": 756,
      "2CCN(C(=O)": 757,
      "OCC1": 758,
      "P(=O)(O)": 759,
      "C2CCCCC": 760,
      "c2ccc(C(=O)N": 761,
      "Cc1ccc(C)": 762,
      "[C@H](NC(=O)": 763,
      "2CC2)": 764,
      "N(": 765,
      "C(=O)C1": 766,
      "c2ccccc2-": 767,
      "Cc1ccc(S(=O)(=O)N": 768,
      "Cc1ccc(C(=O)N": 769,
      "c2c(C)": 770,
      "/C=N": 771,
      "c1ccc(F)cc1)": 772,
      "c2cncc": 773,
      "CO)": 774,
      "n4": 775,
      "c2cc(C)": 776,
      "c3ccccc23)": 777,
      "c2nc(N": 778,
      "c2c(F)cc": 779,
      "CN(C)C": 780,
      "O=C(CN": 781,
      "c1ccc(C(=O)": 782,
      "N(C)": 783,
      "CC(=O)O)": 784,
      "c1ccc(Cl)cc1)": 785,
      "n3cc": 786,
      "(C(=O)NC": 787,
      "c(S(=O)(=O)N": 788,
      "c1ccco1": 789,
      "CCCC(=O)N": 790,
      "c3c2": 791,
      "3C)": 792,
      "CCC(C)C": 793,
      "n[nH]": 794,
      "=C(": 795,
      "CCCCCC1": 796,
      "c3[nH]": 797,
      "C(=O)N(C": 798,
      "NCC": 799,
      "CCC)": 800,
      "c1cccc(Cl)c1": 801,
      "OC)cc": 802,
      "c(F)c(F)": 803,
      "c1cc(Cl)": 804,
      "CCC(O)": 805,
      "2CCCC2": 806,
      "COc1cc2": 807,
      "3CCN": 808,
      "c34)": 809,
      "C(=O)N1CC": 810,
      "nn2": 811,
      "3C": 812,
      "(CCC)": 813,
      "c1ccc(O)cc1": 814,
      "C[C@H]2": 815,
      "CCCn1": 816,
      "CCC(=O)": 817,
      "[C@@H]2CC": 818,
      "[C@@H](C)C": 819,
      "c5cccc": 820,
      "C1=N": 821,
      "(CC(=O)": 822,
      "c1cccc(NC(=O)": 823,
      "CCCN1C(=O)": 824,
      "C(C)=O)": 825,
      "o2)cc1": 826,
      "NN": 827,
      "/C=C2": 828,
      "c2ccccc2)C1": 829,
      "(C3)": 830,
      "CN(C)C(=O)": 831,
      "C[C@@H](O)": 832,
      "OC(": 833,
      "c2ccc(F)cc2": 834,
      "(C(=O)OC)": 835,
      "Nc1n": 836,
      "C(N)=O": 837,
      ")cc2)cc1": 838,
      "CCN)": 839,
      "c4c(c3)": 840,
      "2CCN(C": 841,
      "c2ccncc": 842,
      "N1CC": 843,
      "C(Cl)": 844,
      "(OC)cc": 845,
      "cn2)": 846,
      "c2ccccc2c1": 847,
      "c1c(C)": 848,
      "(CC(C)C)": 849,
      "[N-]": 850,
      "CCCO1": 851,
      "[C@H](N)": 852,
      ")N1CC": 853,
      "CCC(N": 854,
      "CCC(N)": 855,
      "[C@H](C)C": 856,
      "[C@@H](N)": 857,
      "=CC(=O)": 858,
      "o2)": 859,
      "cn1)": 860,
      "-c1ccccc1": 861,
      "c(=S)": 862,
      "=[N+]": 863,
      "c1ncccc1": 864,
      "C)N": 865,
      "[C@H]2CC": 866,
      "=C)": 867,
      "c1ccc(C)": 868,
      "Cc1ccc2c(c1)": 869,
      "3)cc2)": 870,
      "C(=O)NC1": 871,
      "#N)cc1": 872,
      "c2C1": 873,
      "NC": 874,
      "2)C1=O": 875,
      "S)": 876,
      "CNC1": 877,
      "c1ccccn1": 878,
      "c3ccc(Cl)cc3)": 879,
      "c1no": 880,
      "cc(-": 881,
      "O2": 882,
      "2C)": 883,
      "sc2c1": 884,
      "c2ccc(NC(=O)": 885,
      "COCCN": 886,
      "n2C": 887,
      "C2=O": 888,
      "CCO1": 889,
      "c1ccc(C2": 890,
      "c2cccc(C)": 891,
      "N2C(=O)": 892,
      "c2nc(-c3cc": 893,
      "OCc1ccccc1": 894,
      "n12": 895,
      "(I)": 896,
      "/C(C)": 897,
      "c3ccc(C)cc": 898,
      "C[C@H](O)": 899,
      "c1nc(-": 900,
      "CCNC1": 901,
      "CCOc1cc": 902,
      "n2)CC1": 903,
      "3CCCCC3)": 904,
      "C2CC": 905,
      "c3cccc(Cl)": 906,
      "N1CCC": 907,
      "N(C)C": 908,
      "C(F)": 909,
      "c2-": 910,
      "s2)cc1": 911,
      "Cc1cc(-": 912,
      "CC(CC": 913,
      "OCO2": 914,
      "CCCC(C)": 915,
      "c1cccc(C": 916,
      "CC#": 917,
      "C(=O)NC": 918,
      "2CCCCC2)": 919,
      "ccc1": 920,
      "[C@]3": 921,
      "c23)cc1": 922,
      "[C@H](N": 923,
      "C=C(C)": 924,
      "c(=O)n": 925,
      "c2c(Cl)cc": 926,
      "CCC1)": 927,
      "3)c1": 928,
      "[C@@]3": 929,
      "C(CO)": 930,
      "2CCCCC2": 931,
      "COc1ccc(NC(=O)": 932,
      "c1ccccc1Cl": 933,
      "3CCOCC3)": 934,
      "Cc1nn": 935,
      "2(": 936,
      "c1ccccc1F": 937,
      "C(=S)": 938,
      "[C@@H](NC(=O)": 939,
      "nc2c1": 940,
      "/N=C\\": 941,
      "C[C@@H]2": 942,
      "C2)n1": 943,
      "COc1": 944,
      "CS(=O)(=O)N": 945,
      "c1ccc(C(F)(F)F)cc1": 946,
      "COc1ccc(C(=O)N": 947,
      "N(C(=O)": 948,
      "/C=C(/": 949,
      "/N=C/": 950,
      "CCC(C": 951,
      "=CC1": 952,
      "CCN1CC": 953,
      "c1cc2cccc": 954,
      "Cc1cc(C)cc": 955,
      "nc1C": 956,
      "c3C)": 957,
      "CCC(": 958,
      "SC1": 959,
      "O)c1": 960,
      "c2cc(C)cc": 961,
      "O2)": 962,
      "C[C@]1": 963,
      "CCCC(=O)": 964,
      "[C@@H](N": 965,
      "Cc1cc(C(=O)N": 966,
      "CC(C)(O)": 967,
      "O=C1N": 968,
      "c1ccc(OC)cc1": 969,
      "cs3)": 970,
      "c5ccccc5": 971,
      "c(SC": 972,
      "C3=O)": 973,
      "C#N": 974,
      "3)CC1": 975,
      "c3)cc": 976,
      "c3ccc4c(c3)": 977,
      "SCC(=O)N": 978,
      "C(=O)NCC": 979,
      "(C)C)c1": 980,
      "3)cc2)cc1": 981,
      "S(=O)(=O)C1": 982,
      "c3ccc(N": 983,
      "c2c[nH]": 984,
      "(OCC)": 985,
      "c1c(F)cccc1": 986,
      "c2ccc(C(F)(F)F)cc": 987,
      "Cc1ccc(Cl)cc1": 988,
      "C(=O)O)cc1": 989,
      "c1Cl)": 990,
      "on1": 991,
      "[C@@H]4": 992,
      "COc1ccc(N": 993,
      "Cc1cc(C": 994,
      "c2C)cc1": 995,
      "c2cc(": 996,
      "2CCCC2)": 997,
      "[C@@H](CO)": 998,
      "Cc1cccc(N": 999,
      "CC2)CC1": 1000,
      "[C@H]3CC": 1001,
      "c2ccc([N+](=O)[O-])cc": 1002,
      "c1cccc(C(=O)N": 1003,
      "Cc1cccc2": 1004,
      "Cc1ccc(F)cc1": 1005,
      "C(=O)OCC": 1006,
      "c3ccccc3)cc": 1007,
      "c1cc(C(=O)N": 1008,
      "Cc1o": 1009,
      "c1o": 1010,
      "o1)": 1011,
      "c(C2": 1012,
      "CCOc1ccc(": 1013,
      "nc(N)": 1014,
      "(O)cc": 1015,
      "c2cccc(C(F)(F)F)": 1016,
      "Cc1nn(C)": 1017,
      "c1cc(C)cc": 1018,
      "co1)": 1019,
      "c(Cl)c2)": 1020,
      "c(C)n1": 1021,
      "CCC3": 1022,
      "c1cc(F)": 1023,
      "c2scc": 1024,
      "FC(F)(F)": 1025,
      "C)c1": 1026,
      "n2-": 1027,
      "(=N)": 1028,
      "c(NC": 1029,
      "c1ccccc1-": 1030,
      "CC2)n1": 1031,
      "COc1ccc(OC)": 1032,
      "[C@]4": 1033,
      "c(-c3ccccc3)": 1034,
      "C/C=C/": 1035,
      "=C\\": 1036,
      "c1ccc(OC)": 1037,
      "2CCC3": 1038,
      "Cc1[nH]": 1039,
      "ccccc12": 1040,
      "[C@H](C(=O)N": 1041,
      "COC(=O)C1": 1042,
      "c1cccc(C(F)(F)F)": 1043,
      "C(=O)N2": 1044,
      "c2ccccc21)": 1045,
      "nc1-": 1046,
      "c(=O)n(C)": 1047,
      "c2ccc(O": 1048,
      "O=C1CC": 1049,
      "C(C)=O": 1050,
      "[C@H]4": 1051,
      "cn2)cc1": 1052,
      "OC(C)C": 1053,
      "nc12": 1054,
      "CCN(C)C": 1055,
      "c3ccccn3)": 1056,
      "c([N+](=O)[O-])c1": 1057,
      "CC1CC1": 1058,
      "(/C=C/": 1059,
      "(C)=O)": 1060,
      "c1cccn": 1061,
      "(OC)c1": 1062,
      "c5cc": 1063,
      "(C(C)=O)": 1064,
      "CCOCC1)": 1065,
      "CCC(C)(C)": 1066,
      "c2cccc(Cl)c2)": 1067,
      "[Si](C)(C)": 1068,
      "s3)": 1069,
      "O=C(CS": 1070,
      "n2n": 1071,
      "c1ccc2c(": 1072,
      "(C=O)": 1073,
      "OCCO2": 1074,
      "CCCS": 1075,
      "Cc1s": 1076,
      "CCc1nn": 1077,
      "[C@](C)": 1078,
      "c1ccccc1F)": 1079,
      "c1ccccc1Cl)": 1080,
      "cccc3": 1081,
      "c1=O)": 1082,
      "c3ccccc32)": 1083,
      "C(CC)": 1084,
      "CC(C)C1": 1085,
      "c2ccs": 1086,
      "cn3)": 1087,
      "#C": 1088,
      ")N(C": 1089,
      "Cn1cn": 1090,
      "C2=C": 1091,
      "c3cccc(F)": 1092,
      "2)ccc1": 1093,
      "c2cc(Cl)": 1094,
      "C3CC": 1095,
      "Cc1cccc(-": 1096,
      "S(N)(=O)=O)": 1097,
      "c2ccc(-c3cc": 1098,
      "CCCNC1": 1099,
      "2)no1": 1100,
      "(C1)": 1101,
      "C(N)=O)": 1102,
      "COc1ccc2c(c1)": 1103,
      "c3ccccc3F)": 1104,
      "c1ccc(OCC": 1105,
      "c3ncn": 1106,
      "CC3)n": 1107,
      "c3ccco": 1108,
      "[C@@](C)": 1109,
      "3CCCC3)": 1110,
      "CC(=O)N(": 1111,
      "[C@@H](CC": 1112,
      "c(=O)o": 1113,
      "c(OCC": 1114,
      "c2ccccc2C1": 1115,
      "CCC1CC": 1116,
      "(OC)c1OC": 1117,
      "c(O)cc": 1118,
      "2CCOCC": 1119,
      "CCOC(=O)C1": 1120,
      "C4)": 1121,
      ")cc3": 1122,
      "(C(=O)O)C1": 1123,
      "(S(=O)(=O)": 1124,
      "c1cccs1)": 1125,
      "OC)cc1": 1126,
      "CC(C)C)": 1127,
      "Cc1cc(F)cc": 1128,
      "2)c1C": 1129,
      "O=c1[nH]": 1130,
      "c4cn": 1131,
      "c2cc(C(=O)N": 1132,
      "c2cccs2)": 1133,
      "3C(=O)": 1134,
      "CCN1CCC": 1135,
      "C(=O)N(C)C": 1136,
      "C(C)N": 1137,
      "ncc3": 1138,
      "CCN(CC(=O)N": 1139,
      "[C@@H]3CC": 1140,
      "c2ccccc2)n1": 1141,
      "C(=O)N(C)": 1142,
      "c3cc(Cl)cc": 1143,
      "c(=O)[nH]1": 1144,
      "CCS(=O)(=O)": 1145,
      "(Cl)c1": 1146,
      "c2ccc(C)": 1147,
      "3)C1": 1148,
      "2CC3CC": 1149,
      "c4n": 1150,
      "c2ccccn2)": 1151,
      "c3cccc4": 1152,
      "c1ccccc1)c1ccccc1": 1153,
      "c3ccccc3Cl)": 1154,
      "ccc3": 1155,
      "NCC1": 1156,
      "n2)C1": 1157,
      "c2n[nH]": 1158,
      "NC(=O)CS": 1159,
      "c1n[nH]": 1160,
      "[C@@H](C(=O)N": 1161,
      "c(C)cc(C)": 1162,
      "c(CO": 1163,
      "c1ccc(O)": 1164,
      "CC2)C1": 1165,
      "C2)C1": 1166,
      "C1CC1)": 1167,
      "COCCO": 1168,
      "=[N-]": 1169,
      "([N+](=O)[O-])c1": 1170,
      "c2ccc(Cl)cc2": 1171,
      "CCO)": 1172,
      "2CCC(": 1173,
      "c2cccc(-": 1174,
      "c1nc2c(": 1175,
      "O=C(O)C1": 1176,
      ")cc3)": 1177,
      "cc12": 1178,
      "(C(=O)OC": 1179,
      "CCNS(=O)(=O)": 1180,
      "COc1ccc(Cl)cc1": 1181,
      "4CC4)": 1182,
      "[C@H](CC": 1183,
      "c1cc2cc": 1184,
      "c2cc3c(": 1185,
      "c1cccc(F)": 1186,
      "c2cccc(F)c2)": 1187,
      "COCC": 1188,
      ")NC1": 1189,
      "(=O)[nH]": 1190,
      "c2ccc(OC)": 1191,
      "/C=C2\\": 1192,
      "C(F)(F)C(F)(F)": 1193,
      "CCCC(N": 1194,
      "NC(=S)N": 1195,
      "c1c(": 1196,
      "c3o": 1197,
      "c2N": 1198,
      "c3cc4": 1199,
      "(O)CN": 1200,
      "c(Cl)cc1": 1201,
      "C2)CC1": 1202,
      "c2ccc(S(=O)(=O)N": 1203,
      "S(=O)(=O)N1": 1204,
      "CCN(C(=O)N": 1205,
      "C(C)O": 1206,
      "c2=O)cc1": 1207,
      "C=C(C)C": 1208,
      "C=C(": 1209,
      "c1ccc(C(=O)O)": 1210,
      "c2ccc(O)": 1211,
      "c(Cl)c1)": 1212,
      "n2C)": 1213,
      "=[N+]=[N-]": 1214,
      "c(F)c2)": 1215,
      "c(C(N)=O)": 1216,
      "C/C=C\\": 1217,
      "COc1ccc(S(=O)(=O)N": 1218,
      "CC(C)(C)N": 1219,
      "c2)cc": 1220,
      "c1ccccc1N": 1221,
      "c(O)c1": 1222,
      "CNS(=O)(=O)": 1223,
      "O=S(=O)(N": 1224,
      "c1cc2c(cc1": 1225,
      "=NC(=O)": 1226,
      "=CC2": 1227,
      "CC4)": 1228,
      "c1cc2c(": 1229,
      "C[C@@H](": 1230,
      "=C(N)": 1231,
      "c(Cl)c(Cl)": 1232,
      "O=C(CO": 1233,
      "CC(C(=O)N": 1234,
      "CC1(O)": 1235,
      "CC(CN": 1236,
      "OC(C)(C)": 1237,
      "c1c(N": 1238,
      "CC2)cc": 1239,
      "2C)cc1": 1240,
      "CC1CN": 1241,
      "CC(=O)N1CCC": 1242,
      "\\NC(=O)": 1243,
      "C[C@H](": 1244,
      "(/C=N": 1245,
      "c1ccccc1OC": 1246,
      "C(=N)": 1247,
      "CCN2": 1248,
      "nnc1": 1249,
      "c2ccc(C(=O)O)": 1250,
      "4CCCC": 1251,
      "Cc1nc(N": 1252,
      "c(N)n": 1253,
      "c2ccc(Cl)cc2Cl)": 1254,
      "COc1cc(C": 1255,
      "c2ccccc12)": 1256,
      "2)cc1)": 1257,
      "c2cccnc2)": 1258,
      "c(=O)n1": 1259,
      "c2ccc3c(c2)OCO": 1260,
      "cn2)CC1": 1261,
      "CCOC1": 1262,
      "c2cccc3cccc": 1263,
      "c1ccccc1)C(=O)": 1264,
      "OCC(=O)": 1265,
      "c3cccc(Cl)c3)": 1266,
      "CC(=O)OC": 1267,
      "c1cnc(N": 1268,
      "c2c1C": 1269,
      "CC1(": 1270,
      "S(C)(=O)=O)cc1": 1271,
      "c1ccccc1NC(=O)": 1272,
      "=NN": 1273,
      "c1cccc(C)c1": 1274,
      "CN1CCN(": 1275,
      "cccn": 1276,
      "CC(C)CN": 1277,
      "c2ccc3ccccc3": 1278,
      "c2ccccc2n1": 1279,
      "CCCn1cc": 1280,
      "n2nn": 1281,
      "Cc1cc(Cl)cc": 1282,
      "CCNC(=O)N": 1283,
      "C3)n": 1284,
      "c(F)cc1": 1285,
      "=CC=C": 1286,
      "Cc1nc(C": 1287,
      "c1ccco1)": 1288,
      "c1ccc(F)c(F)c1": 1289,
      "=O)N": 1290,
      "CC1C": 1291,
      "c2ccc(O)cc": 1292,
      "c2c(N": 1293,
      "Cc1cccnc1": 1294,
      "C(C)C)cc1": 1295,
      "CC1CCCCC1": 1296,
      "2)cc1OC": 1297,
      "CC[C@@H]1": 1298,
      "COCC1": 1299,
      "cc21": 1300,
      "c2ncccc2": 1301,
      "OC3": 1302,
      "c1c(Cl)cccc1": 1303,
      "nc1N": 1304,
      "CC=C": 1305,
      "c2ccn": 1306,
      "CCOCCO": 1307,
      "n4)": 1308,
      "c2o1": 1309,
      "/C(=N/": 1310,
      "(C1": 1311,
      "CCC3)": 1312,
      "/C=C1": 1313,
      "cc2Cl)": 1314,
      "(CC)CC": 1315,
      "B(O)": 1316,
      "Cc1ccc(O": 1317,
      ")N1CCN(": 1318,
      "(Cc2ccccc2)": 1319,
      "[nH]c2c1": 1320,
      "c1c(C": 1321,
      "CCOC(=O)C1=C": 1322,
      "CC3)cc": 1323,
      "N=C(": 1324,
      "c2cc(F)": 1325,
      ")ccc1OC": 1326,
      "ncn1": 1327,
      "C=CCn1": 1328,
      "Cc1ccc(CN": 1329,
      "c4ccc(F)cc": 1330,
      "C[C@H](NC(=O)": 1331,
      "c1ccccc1O": 1332,
      "c1ccc(Cl)c(Cl)c1": 1333,
      "[C-]": 1334,
      "C2CC2)cc1": 1335,
      "c3ccc(Cl)cc3": 1336,
      "c2c(C": 1337,
      "/C1=C": 1338,
      "4CCOCC": 1339,
      "[C@@H](O": 1340,
      "c3cccnc3)": 1341,
      "c2nnn": 1342,
      "COc1ccc(C2": 1343,
      "CC2CC": 1344,
      "CC[C@H](C)": 1345,
      "c2c1)": 1346,
      ")N(C)C": 1347,
      "CCN(CC)C(=O)": 1348,
      "[C@H](O": 1349,
      "c1ccsc1": 1350,
      "c2ccco2)": 1351,
      "c1nc(-c2cc": 1352,
      "cs2)": 1353,
      "/C=N/": 1354,
      "CCCCCCC": 1355,
      "C(C)C(=O)N": 1356,
      "C(NC(=O)": 1357,
      "COc1ccc(CN": 1358,
      "CC(C)NC(=O)": 1359,
      "[C@@H](O)[C@H](O)": 1360,
      "c2cccc([N+](=O)[O-])": 1361,
      "CC(=O)N1CC": 1362,
      "CO1": 1363,
      "COc1ccc(C)cc1": 1364,
      "CCC(NC(=O)": 1365,
      "c3cccs3)": 1366,
      "Cc1cc(NC(=O)": 1367,
      "C(C(=O)N": 1368,
      "c3ccc(F)cc3": 1369,
      "[Si](C)(C)C)": 1370,
      "Cc1ccccc1-": 1371,
      "Cc1cccc(C": 1372,
      "C1CCN(C(=O)": 1373,
      "c(CC)": 1374,
      "c2s1": 1375,
      "O=C(CN1": 1376,
      "c1cccc(O": 1377,
      "c1cccc2c1": 1378,
      "COc1cccc2": 1379,
      "(NS(=O)(=O)": 1380,
      "c1ccc(S": 1381,
      "[C@@H](C)C(=O)N": 1382,
      "CCCO)": 1383,
      "c1ncc(-": 1384,
      "Cc1cccc(NC(=O)": 1385,
      "c1cccc(OC": 1386,
      "C[C@@]1": 1387,
      "CN2": 1388,
      "=O)c1": 1389,
      "c1cccc(CN": 1390,
      "COc1cc(": 1391,
      "CC(C)(C)OC(=O)": 1392,
      "(C3)C1)": 1393,
      "1CCCCC1)": 1394,
      "c1ccccn1)": 1395,
      "c3ccc(OC)cc": 1396,
      "c3ccccc32)cc1": 1397,
      "CCC(CC": 1398,
      "/C=C(\\C)": 1399,
      "N)c1": 1400,
      "2CC3": 1401,
      ")ccc1O": 1402,
      "c(=O)n(C": 1403,
      "n3cn": 1404,
      "c2nc3c(": 1405,
      "3CCN(": 1406,
      "CN)": 1407,
      "CCCC)": 1408,
      "OC(C)=O": 1409,
      "(N)=N": 1410,
      "c3nc4ccccc4": 1411,
      "C2=N": 1412,
      "[C@@H]2O": 1413,
      "#[N+]": 1414,
      "c1C#N": 1415,
      "OCCCO": 1416,
      "C(=C)": 1417,
      "[C-]#[N+]": 1418,
      "n(": 1419,
      "oc1": 1420,
      "COc1cccc(-": 1421,
      "Cc1ccc(C(=O)": 1422,
      "Cl)cc": 1423,
      "2)cn1": 1424,
      "CCC4": 1425,
      "c(I)": 1426,
      "c3cccc(F)c3)": 1427,
      "OCC2": 1428,
      "CC(O": 1429,
      "c3ccncc": 1430,
      "[nH]1)": 1431,
      "c1NC(=O)": 1432,
      "c2cc3cccc": 1433,
      "CCCN(CC": 1434,
      "COc1ccc(C(=O)": 1435,
      "c1nnn": 1436,
      "COc1cc(N": 1437,
      "O=C(/C=C/": 1438,
      "/C(C#N)": 1439,
      "4)cc3)": 1440,
      "c2ccccc2)N": 1441,
      "2)s1": 1442,
      "n(CC": 1443,
      "CNC(": 1444,
      "nc2)": 1445,
      "c1cccc(Cl)c1)": 1446,
      "(F)F)cc": 1447,
      "c3cccc(C)": 1448,
      "CCc1": 1449,
      "O=C(NC1": 1450,
      "CCCN2C(=O)": 1451,
      "(c3ccccc3)": 1452,
      "(C)C)N": 1453,
      "=CCCC": 1454,
      "c3ccco3)": 1455,
      "nnc1-": 1456,
      "(C(O)": 1457,
      "(CCl)": 1458,
      "I)cc": 1459,
      "CC1O": 1460,
      ")cc21": 1461,
      "/C(=N\\": 1462,
      "@]": 1463,
      "C)C1": 1464,
      "c1ccc(Cl)cc1Cl": 1465,
      "COc1cc2c(cc1": 1466,
      "C=CCO": 1467,
      "c2)N": 1468,
      "2CC3CC(CC": 1469,
      "c3ccc(C)cc3)": 1470,
      "c(N)c1": 1471,
      "S(=O)(=O)O": 1472,
      "n1nn": 1473,
      "Cc1nc(-": 1474,
      "CCC(=O)O": 1475,
      "o3)": 1476,
      "c(=O)cc": 1477,
      "n[nH]1": 1478,
      "[C@H](C)C(=O)N": 1479,
      "c1ccccc1)C(=O)N": 1480,
      "(CC2)": 1481,
      "c3cc(F)cc": 1482,
      "c1cccnc1)": 1483,
      "CCCCCCCCCCCC": 1484,
      "S2": 1485,
      "c(=O)n2": 1486,
      "c1ccc2[nH]": 1487,
      "O=C(O": 1488,
      "CC1CC1)": 1489,
      "CCN2C(=O)": 1490,
      "CCC2)": 1491,
      "nn3": 1492,
      "(O)C1": 1493,
      "c3ccc(-": 1494,
      "c2ccc(C)cc2)": 1495,
      "O)C1": 1496,
      "P(=O)(O)O": 1497,
      "(C(=O)O)cc": 1498,
      "[C@H](C(=O)O)": 1499,
      "C(=O)N1CCN(": 1500,
      "CC(CO)": 1501,
      "(N)=S)": 1502,
      "(C)C)n1": 1503,
      "CC1CCCC": 1504,
      "c6": 1505,
      "(C(=O)O": 1506,
      ")ccc1F": 1507,
      "c(OC)cc": 1508,
      "c1cccc2ccccc12": 1509,
      "CCc1ccc(": 1510,
      "c1cccc(C)": 1511,
      "/C=C/C(=O)N": 1512,
      "c3ccc(OC": 1513,
      "(C(=O)OCC)": 1514,
      "C(C(=O)O)": 1515,
      "c3=O)": 1516,
      "N1CCN(": 1517,
      "c(C)c1C": 1518,
      "c1nnc(-": 1519,
      "N=C1": 1520,
      "CCCN2": 1521,
      "Cc1noc(C)c1": 1522,
      "CCCCNC(=O)": 1523,
      "c2cnn(C)": 1524,
      "c1ccc2c(c1)OCO2": 1525,
      "c(C(C)(C)C)": 1526,
      "CCOC(=O)c1": 1527,
      "nn(C)": 1528,
      "CCOc1ccc(N": 1529,
      "CC1(C)O": 1530,
      "I)cc1": 1531,
      ")ccc1N": 1532,
      "c4ccc(Cl)cc": 1533,
      "nc4": 1534,
      "COC(=O)c1cc": 1535,
      "c2ccccc2C": 1536,
      "CCCC3)": 1537,
      "Cc1cc(": 1538,
      "C(=O)NC(=O)": 1539,
      "Cc1c(Cl)cc": 1540,
      "[n+]": 1541,
      "CCCOC": 1542,
      "s2)c1": 1543,
      "O[C@@H]1": 1544,
      "CCS(=O)(=O)N": 1545,
      "[nH]c1": 1546,
      "c2cccc(OC)": 1547,
      "1CCC(N": 1548,
      "CCOc1ccc(C": 1549,
      "CCCOC(=O)": 1550,
      "c2ccc(Cl)cc2)cc1": 1551,
      "sc1C": 1552,
      "c1cc(C(F)(F)F)cc": 1553,
      "o2)c1": 1554,
      "OCC1c2ccccc2-": 1555,
      "Cc1c(C(=O)N": 1556,
      "[C@]4(C)": 1557,
      "c3cc(C)": 1558,
      "C[C@H](N": 1559,
      "c1cccc(S(=O)(=O)N": 1560,
      "c2cccc(N": 1561,
      "c2ccc(CN": 1562,
      "nc21": 1563,
      "cn2)c1": 1564,
      "4)CC3)": 1565,
      "C(CN": 1566,
      "c1c(C)cc": 1567,
      "c2nc(C)": 1568,
      "CN(CC(=O)N": 1569,
      "NC(": 1570,
      "c1cccc(C(F)(F)F)c1": 1571,
      "O=S(=O)(": 1572,
      "c1nc(N)": 1573,
      "C2=O)c1": 1574,
      "c(CC(=O)N": 1575,
      "CCNC(": 1576,
      "nc3)": 1577,
      "n2c1": 1578,
      "(c1ccccc1)c1ccccc1": 1579,
      "c2ccc(C(=O)": 1580,
      "c1cccc(O)": 1581,
      "2CCCO": 1582,
      "2CC3CC(CC(C3)C1)": 1583,
      "4)cc3": 1584,
      "C(=O)NC(C)": 1585,
      "CCC(C)N": 1586,
      "CCc1ccc(C": 1587,
      "C1O": 1588,
      "Cc1ccc(F)": 1589,
      "c1ccc(C)cc1)": 1590,
      "=C(C)": 1591,
      "2CCCCC2)cc1": 1592,
      "CC1=O": 1593,
      "CCCO1)": 1594,
      "C[C@@H]1CC": 1595,
      "S(C)(=O)=O)cc": 1596,
      "c3c(F)cc": 1597,
      "CC[C@@H](C)": 1598,
      "c1cnn(C)": 1599,
      "N=C(N)": 1600,
      "c2ccc3n": 1601,
      "CCCCCN": 1602,
      "COc1cc(C)": 1603,
      "n(-c2ccccc2)": 1604,
      "Nc1cc": 1605,
      "Oc1ccccc1": 1606,
      "n2)n1": 1607,
      "O=C(COC(=O)": 1608,
      "3)ccc21": 1609,
      "(C3": 1610,
      "CC[C@H]1": 1611,
      "c2cc(Cl)ccc2": 1612,
      "c(=O)[nH]c1=O": 1613,
      "4CCCCC": 1614,
      "C(=O)O)cc": 1615,
      "(F)F)cc1": 1616,
      "C(CN)": 1617,
      "Cn1ncc": 1618,
      "S(=O)(=O)c1ccccc1": 1619,
      "4CCC": 1620,
      "C1C": 1621,
      "[C@]2(C)": 1622,
      "[nH]cc": 1623,
      "cc2F)": 1624,
      "c(C(C)": 1625,
      "(CCN)": 1626,
      "c1ccc([N+](=O)[O-])": 1627,
      "CC(=O)N(C": 1628,
      "Cc1ccc(OC": 1629,
      "(CCC(=O)N": 1630,
      "O=S": 1631,
      "[Si](C)(C)C(C)(C)C)": 1632,
      "CNC(C)": 1633,
      "c2ccc(F)cc2F)": 1634,
      "2CCC(N": 1635,
      "SC)": 1636,
      "c1ccc2ccccc2c1": 1637,
      "n2ncc": 1638,
      "c3c2)": 1639,
      "c1cccc(F)c1)": 1640,
      "C1CCN(": 1641,
      "C/C(=C\\": 1642,
      "nc(C(=O)N": 1643,
      "NC(=O)C2": 1644,
      "2CCOC": 1645,
      "O=c1": 1646,
      "cc1-": 1647,
      "=CC(": 1648,
      "OCCC": 1649,
      "C3CC3)": 1650,
      "c2c3c(": 1651,
      "3CCCC3": 1652,
      "c1ccc(N)cc1": 1653,
      "C[C@@H](NC(=O)": 1654,
      "O)CC1": 1655,
      "C1(C)C": 1656,
      "c3cc(-": 1657,
      "c2ccc(F)cc2)CC1": 1658,
      "c(C(C)C)": 1659,
      "CCCC(": 1660,
      "c2ccc(OCC": 1661,
      "2(CC1)": 1662,
      "C(=O)OC)": 1663,
      "c1nc(C)": 1664,
      "c2cn[nH]": 1665,
      "c[nH]1": 1666,
      "c(C)no": 1667,
      "/C(C)=C/": 1668,
      "c3ccc([N+](=O)[O-])cc": 1669,
      "C)cc": 1670,
      "c2ccc(F)cc2)cc1": 1671,
      "CC1)N": 1672,
      "c3cc(C)cc": 1673,
      "C[C@H]3": 1674,
      "COc1cc(-": 1675,
      "CCNC(C)": 1676,
      "N1CCOCC1": 1677,
      "Cc1ccc(Cl)": 1678,
      "cs2)cc1": 1679,
      "n2ccnc2": 1680,
      ")N1CCOCC1": 1681,
      "(=O)o": 1682,
      "N)cc1": 1683,
      "(C)(C)C)cc1": 1684,
      "CC(C(=O)O)": 1685,
      "c32)": 1686,
      "2)nn1": 1687,
      "C(=O)OC(C)(C)C": 1688,
      "c2c(c1": 1689,
      "CCN(C(=O)OC(C)(C)C)": 1690,
      "c1ccccc1C": 1691,
      "(-c3ccccc3)": 1692,
      "COCCN1": 1693,
      "C(=O)N2C": 1694,
      "OCO4)": 1695,
      "N=C(N": 1696,
      "=C(C#N)": 1697,
      "OC(C)(C)C(C)(C)": 1698,
      "[nH]n1": 1699,
      "COc1cc(OC)": 1700,
      "[C@@H]1C": 1701,
      "2Cl)cc1": 1702,
      "(O)CC": 1703,
      "c(F)c1F": 1704,
      "C1(": 1705,
      "c4ccccc34)": 1706,
      "c1ccncc1)": 1707,
      "COCCNC(=O)": 1708,
      "OC(C": 1709,
      "=[N+]=[N-])": 1710,
      "c1nc(Cl)": 1711,
      "nc2s": 1712,
      "CNC(C": 1713,
      "c3cncc": 1714,
      "(-c2ccccc2)": 1715,
      "CCCN(S(=O)(=O)": 1716,
      "CCOc1ccc(-": 1717,
      "c3F)": 1718,
      "O[C@H]1": 1719,
      "=N1": 1720,
      "c4ncc": 1721,
      "C(C)CC": 1722,
      "c1cccc([N+](=O)[O-])c1": 1723,
      "CC1(C)CC": 1724,
      "c1ccc(N)": 1725,
      "Cc1cc(CN": 1726,
      "C(=O)O)c1": 1727,
      "COC(=O)C1=C": 1728,
      "[C@]12C": 1729,
      "c1ccc(Cl)cc1Cl)": 1730,
      "Cc1cccc(C(=O)N": 1731,
      "c(C3": 1732,
      "O=C(NCC": 1733,
      ")cc12": 1734,
      "n3)n": 1735,
      "c1co": 1736,
      "3CC4CC": 1737,
      "Cc1ccco1": 1738,
      "[C@@]2(C)": 1739,
      "c2ccccc2c1=O": 1740,
      "C[C@H]1CC": 1741,
      "c2cccc3ccccc23)": 1742,
      "CC1CN(": 1743,
      "Cc1ccccc1)": 1744,
      "C(N)=N/": 1745,
      "C(c2ccccc2)": 1746,
      "ncnc1": 1747,
      "Cc1ccc(C2": 1748,
      "(C4)": 1749,
      "2CCCC2)cc1": 1750,
      "(N)=O": 1751,
      "CCCC3": 1752,
      "COc1ccccc1-": 1753,
      "(C(F)(F)F)cc": 1754,
      ")NCC": 1755,
      "COc1cc(C(=O)N": 1756,
      "c2C)c1": 1757,
      "CCCCCCCCC": 1758,
      "c3c(C)": 1759,
      "SC(=S)N": 1760,
      "c3ccccc3)CC2)": 1761,
      "c1cn2": 1762,
      "C[C@@H](N": 1763,
      "C(=O)Nc1ccccc1": 1764,
      "c2ccc3c(": 1765,
      "COc1cccc(C": 1766,
      "C(=O)c1ccccc1": 1767,
      "[C@@]4": 1768,
      "c3cs": 1769,
      "CC1CCN(": 1770,
      "c2ccc(OC)cc2)": 1771,
      "Cc1cccc(CN": 1772,
      "[nH]2)": 1773,
      "3CC3)n": 1774,
      "c(F)c1)": 1775,
      "c4ccccc43)": 1776,
      "c2c(-": 1777,
      "nc1)": 1778,
      "c1ccc2n": 1779,
      "C[C@@H]3": 1780,
      "s2)CC1": 1781,
      "c1ccc(F)cc1F": 1782,
      "c2ccccc2C)": 1783,
      "O=C(C1": 1784,
      "cc4": 1785,
      "=NNC(=O)": 1786,
      "CCNC(C": 1787,
      "Nc1ncc": 1788,
      "c1ccc(CC": 1789,
      "CCN(CC)S(=O)(=O)": 1790,
      "(C)C2": 1791,
      "c2cccc(O)": 1792,
      "=C(\\": 1793,
      "CCN1CCN(": 1794,
      "C1CCCC": 1795,
      "COc1cccc(N": 1796,
      "C=CC(=O)N": 1797,
      "C=C/": 1798,
      "C2CC2)c1": 1799,
      "c2ccccc2)cc": 1800,
      "NC(=O)OC(C)(C)C": 1801,
      "[nH]c1=O": 1802,
      "c2cc(NC(=O)": 1803,
      "O3)": 1804,
      "[C@H]1C": 1805,
      "CCN(C)C(=O)": 1806,
      "(C)C)C1": 1807,
      "c3ccccc3-": 1808,
      "P(=O)(O)O)": 1809,
      "5CC": 1810,
      "Cc1ccncc1": 1811,
      "1CC2": 1812,
      "c2cn3": 1813,
      "c1nnc(C": 1814,
      "c1ccnc(N": 1815,
      "O1)": 1816,
      "OC(C)(C)O": 1817,
      "C(=O)O1": 1818,
      "CCCl)": 1819,
      ")N1CCCC1": 1820,
      "Cc2ccccc2)": 1821,
      "CSc2nn": 1822,
      "CCCCCCCCCCCCCCCC": 1823,
      "c1ccc(C(=O)O)cc1": 1824,
      "c3Cl)": 1825,
      ")c1ccccc1": 1826,
      "S(=O)(=O)O)": 1827,
      "cn3": 1828,
      "(C2)": 1829,
      "c2[nH]1": 1830,
      "C[C@H](C)": 1831,
      "NC(C": 1832,
      "5)cc": 1833,
      "n1-c1ccccc1": 1834,
      "c2cccc(C(F)(F)F)c2)": 1835,
      "(Cl)cc1": 1836,
      "n(C)n1": 1837,
      "O=C(OC": 1838,
      "CCN(C)CC1": 1839,
      "c32)cc1": 1840,
      "n3)cc": 1841,
      "CC(C)n1": 1842,
      "c3n2": 1843,
      "Cc2ccco": 1844,
      "Cc1cccc(O": 1845,
      "C=C(N": 1846,
      "c1ccc2c(c1)OCCO2": 1847,
      "c1cc(CN": 1848,
      "CCCN(C)": 1849,
      "c2ccc(F)c(F)": 1850,
      "4CCOCC4)": 1851,
      "C(CC(=O)O)": 1852,
      "N#Cc1": 1853,
      "CC(S": 1854,
      "NC(=O)CO": 1855,
      "CC(C)(C)OC(=O)N1": 1856,
      "c2c1=O": 1857,
      "CC1=N": 1858,
      "2CCS": 1859,
      "nc(": 1860,
      "C(c1ccccc1)": 1861,
      "CCCCn1": 1862,
      "CN(C)S(=O)(=O)": 1863,
      "(O)(": 1864,
      "c1ccc(-c2ccccc2)cc1": 1865,
      "N(C)C(=O)": 1866,
      "c(CO)": 1867,
      "C(O)C(O)": 1868,
      "C(=O)N(CC": 1869,
      "CC(CN)": 1870,
      "CCOCC2)": 1871,
      "/C=C2/": 1872,
      "CC2CCC1": 1873,
      "CCN(CCO)": 1874,
      "c3cccc(C(F)(F)F)": 1875,
      ")N2": 1876,
      "c1nccs1": 1877,
      "c2cc([N+](=O)[O-])cc": 1878,
      "CC2C": 1879,
      "[C@@H](C(=O)O)": 1880,
      "C3)cc": 1881,
      "c(C(F)(F)F)c1": 1882,
      "c2ccc(C(C)(C)C": 1883,
      "cn2)C1": 1884,
      "C2)cc": 1885,
      "=CCC1": 1886,
      "(=N": 1887,
      "c(C(=O)NC": 1888,
      "=CC(=O)N": 1889,
      "=C(C": 1890,
      "n2cccc": 1891,
      "[C@H]2O": 1892,
      "[N+](=O)[O-])cc2": 1893,
      "c2ccc(Cl)c(Cl)c2)": 1894,
      "OCc2ccccc2)": 1895,
      "(Cl)Cl)": 1896,
      "c1ccc(O)cc1)": 1897,
      "C=O)": 1898,
      "c1nc2ccccc2s1": 1899,
      "(OC)c(OC": 1900,
      "c2cccc(OC": 1901,
      "=C3": 1902,
      "CCN(C)CC": 1903,
      "c(CCl)": 1904,
      "c2ccc(Cl)c(Cl)": 1905,
      "c2ccc3c(c2)OCCO": 1906,
      "c(CNC(=O)": 1907,
      "[C@H](CN": 1908,
      "(S(N)(=O)=O)": 1909,
      "NC(=S)": 1910,
      "Cc1cccc(C)c1": 1911,
      "c2cnc(N": 1912,
      "c2c(=O)": 1913,
      "n2c(": 1914,
      "C1CCC1": 1915,
      "[NH": 1916,
      "CN1CCN(C(=O)": 1917,
      "c2nc(-c3ccccc3)": 1918,
      "OCc1ccccc1)": 1919,
      "c2cc(S(=O)(=O)N": 1920,
      "c(-c4ccccc4)": 1921,
      "c1ccc(C#N)cc1": 1922,
      "C(=NC)N": 1923,
      "c3ccc(Cl)": 1924,
      "c2c(N)": 1925,
      "CCc1ccc(N": 1926,
      "(S)": 1927,
      "(NN)": 1928,
      "c1cccc(": 1929,
      "2CCOCC2)cc1": 1930,
      "C(=O)C2": 1931,
      "c1cc(Cl)ccc1": 1932,
      "C1CCCCC1)": 1933,
      "c(C(F)(F)F)cc": 1934,
      "c1cc(NC(=O)": 1935,
      "CN(C(=O)N": 1936,
      "C(F)(F)F)cc1": 1937,
      "2CCc3ccccc3": 1938,
      "OC1(C)C": 1939,
      "c1cc(OC": 1940,
      "Cc1c(Cl)cccc1": 1941,
      "CCCN1CC": 1942,
      "e]": 1943,
      "CC(C)(C)OC(=O)N1CCC": 1944,
      "(C)C(C)": 1945,
      "Cn1nn": 1946,
      "CCn1cn": 1947,
      "C1CCN(C": 1948,
      "c2cc(C(F)(F)F)cc": 1949,
      "C)cc1": 1950,
      "C=CC(=O)": 1951,
      "c2cccc3c2": 1952,
      "3CCN(C": 1953,
      "CN(CCC": 1954,
      "CNCC1": 1955,
      "[C@@H]12": 1956,
      "c5c(": 1957,
      "(Cl)Cl": 1958,
      "CC2=O)cc1": 1959,
      "=C(/": 1960,
      "C(=O)OCC(=O)N": 1961,
      "COc2ccccc2": 1962,
      ")N1CCN(C": 1963,
      "c2cccc(C": 1964,
      "CCc1cn": 1965,
      "n2)cc": 1966,
      "(CCC(=O)O)": 1967,
      "CCc1ccc(-": 1968,
      "-2": 1969,
      "c3ccccc23)cc1": 1970,
      "=C(O)": 1971,
      "/C=N\\": 1972,
      "OCCN": 1973,
      "c3ccccc3)cc2": 1974,
      "N=C2": 1975,
      "CC1CCCC1": 1976,
      "c2ccc(OC)cc": 1977,
      "c2N)": 1978,
      "c1ccc2ccccc2": 1979,
      "c1c(-": 1980,
      "c1ccc2c(c1)OCO": 1981,
      "C(=O)NC2": 1982,
      "n2n1": 1983,
      "OC1=O": 1984,
      "[C@H](C)NC(=O)": 1985,
      "c3ccc(O)cc": 1986,
      "CCCNC(": 1987,
      "CNC(=O)N": 1988,
      "c2cc(OC)cc": 1989,
      "nc(Cl)": 1990,
      "CCCCOC(=O)": 1991,
      "c(F)cc2": 1992,
      "C(=O)CC": 1993,
      "COC(=O)N": 1994,
      "C(F)(F)F)cc": 1995,
      "(N)=O)cc1": 1996,
      "c2nc(N)": 1997,
      "c1nnc(-c2cc": 1998,
      "OC(CO)": 1999,
      "c3ccc4": 2000,
      "(CC)CC)": 2001,
      "c2sc3c(": 2002,
      "=S)N": 2003,
      "c2cc3c(cc2": 2004,
      "cnc2)": 2005,
      "[C@@]21": 2006,
      "C#N)C(=O)N": 2007,
      "/N=C(\\": 2008,
      "1(=O)": 2009,
      "COc1cc(CN": 2010,
      "NC(=N": 2011,
      "C(C)C1": 2012,
      "c2ccccc2N": 2013,
      "[C@@H]21": 2014,
      "c2cccc(C(=O)N": 2015,
      "C2)cn1": 2016,
      "OC)c1": 2017,
      "(C)C)CC1": 2018,
      "CN2C(=O)": 2019,
      "c2cco": 2020,
      "(CC2": 2021,
      "3CCN(C(=O)": 2022,
      "CCOC(=O)N": 2023,
      "CC(C)(C)C1": 2024,
      "C2=O)cc": 2025,
      "[C@@H](C)O": 2026,
      "C)n1": 2027,
      "COc1cccc(CN": 2028,
      "c3no": 2029,
      "c3ccccc3C)": 2030,
      "c2ccc(F)cc2)c1": 2031,
      "CCCO3)": 2032,
      "CCC=C": 2033,
      "(C)CC(=O)N": 2034,
      "c4cccn": 2035,
      "CNC(=O)C1": 2036,
      "c2ccccc2C1=O": 2037,
      "c2ccc3c(c2)OCO3)": 2038,
      "CCOc1ccc(NC(=O)": 2039,
      "C1CCS(=O)(=O)C1": 2040,
      "c2ccncc2)": 2041,
      "CC(F)(F)": 2042,
      "cc1C": 2043,
      "2C3": 2044,
      "CCCN(CCC)": 2045,
      "C=CC1": 2046,
      "c2c(cc": 2047
    },
    "merges": [
      [
        "c",
        "c"
      ],
      [
        "C",
        "C"
      ],
      [
        "(",
        "C"
      ],
      [
        "O",
        ")"
      ],
      [
        "c",
        "1"
      ],
      [
        "=",
        "O)"
      ],
      [
        "(",
        "=O)"
      ],
      [
        "c",
        "2"
      ],
      [
        "(C",
        ")"
      ],
      [
        "c1",
        "cc"
      ],
      [
        "c",
        "("
      ],
      [
        "C",
        "(=O)"
      ],
      [
        "H",
        "]"
      ],
      [
        ")",
        "cc"
      ],
      [
        "c2",
        "cc"
      ],
      [
        "[",
        "C"
      ],
      [
        "[C",
        "@"
      ],
      [
        "CC",
        "C"
      ],
      [
        "c",
        "3"
      ],
      [
        "F",
        ")"
      ],
      [
        "c",
        "(C"
      ],
      [
        "=",
        "C"
      ],
      [
        "2",
        ")"
      ],
      [
        "O",
        "C"
      ],
      [
        "c1cc",
        "cc"
      ],
      [
        "C",
        "1"
      ],
      [
        "CC",
        "1"
      ],
      [
        "CC",
        "N"
      ],
      [
        "(",
        "N"
      ],
      [
        "(C)",
        "C"
      ],
      [
        ")cc",
        "1"
      ],
      [
        "(",
        "F)"
      ],
      [
        "[C@",
        "@"
      ],
      [
        "n",
        "1"
      ],
      [
        "(=O)",
        "N"
      ],
      [
        "C",
        "O"
      ],
      [
        "c2cc",
        "cc"
      ],
      [
        "c1cc",
        "c("
      ],
      [
        "[C@",
        "H]"
      ],
      [
        "[C@@",
        "H]"
      ],
      [
        "CC",
        "CC"
      ],
      [
        "c3",
        "cc"
      ],
      [
        "c",
        "n"
      ],
      [
        "C",
        "N"
      ],
      [
        "C(=O)",
        "N"
      ],
      [
        "c1cccc",
        "c1"
      ],
      [
        "c2cccc",
        "c2"
      ],
      [
        "l",
        ")"
      ],
      [
        "3",
        ")"
      ],
      [
        "(",
